{
    "BigPenny": "Pitches often focus on the subject of change, pointing out problems and promising to do it better. However I think both the Thales Council and the Thales dev team have proven to be good stewards for the Thales protocol in the past months. Looking at the numbers, Thales is growing in users, volume and revenue despite very adverse market conditions. I want to continue supporting this positive momentum as part of the Thales Council, always being honest, true to my word and acting in the best interest of the Thales community.\n\nOutlook for the upcoming epoch and beyond:\nIt’s important to continue efforts to decentralize the protocol in every regard, DAO, contracts, data providers all included. Redundancy is also an important factor, especially in terms of data required to run Overtime and Thales AMM in general. We have fantastic partners supporting us and efforts should be continued to aggregate data from as many high quality sources as possible. Everyone loves $OP rewards and my intention is to continue distributing our $OP budget to protocol users. There is potential to either increase or prolong rewards beyond the initial schedule thanks to the fact that we have a dedicated budget for Overtime now. At the same time it’s important to carefully run trials on other means of user retention and organic protocol growth since $OP rewards will not last forever. Those trials will provide useful data on organic protocol volume which is an important success factor.\n\nFinally I want to thank the Thales community as a whole for always maintaining a bullish attitude and supporting the protocol not just on chain through usage but also publicly on social media and through community engagement on Discord.\n\nOnly Thales can make a 🐻 market feel like a 🍺 market!\n\nancientgreekfrog.eth",
    "milkywave": "Hey family,\n\nI joined this server just under 13 months ago and it feels more like I've been here half my life.\nWhy? No, not because we are in a bear market and everything is boring but more because so much has happened in the last year and Thales has evolved into a protocol that I could not have imagined in my wildest dreams.\n\nI think most people here already know me, so I'll keep this part short. 🥛🌊 is a wave of energy, grateful to have served twice as Oracle Council 🔮 and to have been responsible for various marketing tasks for Exotics. Recently responsible for the internal community marketing group called Olympians and various marketing activities for Overtime.\n▶️ If you don't know me yet, DM's are open.\n\nAnd now it is time and I feel ready to nominate myself for the Thales Council. My experience with the protocol (both as an end user but also on the marketing side) and the active involvement - I wrote my first few TIPs in the last half year and participated in almost all discussions around the TIPs -  as well as my deep roots in the community make me the perfect council member.\n\nMy focus as a council member will be to be as open to all opinions/topics and to include my voters besides my personal opinion when making decisions. In addition, I will also communicate clearly and transparently (Even if the opinion is not majority).\n\nMy goal for the next epoch is to push Overtime to the absolute market leader. (Yes, I have a bet going that by the end of the first semester 2023 Overtime will have overtaken Thales AMM in $ volume).\n\nI am very motivated to work together with the community and my possible future Council colleagues and to keep up the same speed as now.\n\nThanks to all of you who will vote for me - Ride the Milkywave with me and #VoteforMilkywave 🥛🌊\n\nENS: cocomilk.eth",
    "ramblers99": "As a two-time Thales Council member, I would like to once again ask for your vote in the upcoming election. I think Thales is at a crossroads, and I wish to continue to help us navigate. I think we have the greatest team in all of defi that can execute even the most ambitious of road maps. I have the utmost respect for them and the project. The crossroads I see is that while we are a DAO (which is still experimental in production), we are starring down the real possibility of centralizing our council's opinion to be more monotone than it should be.\n\nWhere I stand on key issues:\nOvertime: I think the next 4 months needs to be hyper focused on OP growth, but still tracking where user growth is on other chains and roll-ups. If the opportunity (incentives) to launch somewhere else becomes a reality, we should consider and be open to pivot.\nEmissions: SafeBox burning Thales is great, especially with increased WC action in Overtime, but imo we are leaking too many Thales via LP incentives and even regular staking.\nThales staking: This ties into the emissions above. If the WC action can translate into sustained Overtime action after the tournament, then we should be prepared to pivot to distributing sUSD to stakers in lieu of/or to supplement Thales rewards. As Mr Breakout pointed out, this would have been over $250 last week to those staking 100k Thales. https://twitter.com/IamMrBreakout/status/1599693407185604608\nLP voting: This will be my primary push if elected. Being a metagovernace vote, I think it is CRUCIAL that someone is on the council that will not bend to offering LP voting rights that incentivize centralizing into less efficient liquidity protocols. While I understand that was not the intent of the last LP vote (TIP-100), it is what the result would have been. Also, to put my money where my mouth is... I will be moving most of my Thales to LP after this election.\n\nThank you for your consideration!\n\nRamblers99\n0x1Ed8AAa1A4BaE76B8e1135eb63Be6491e5bD556b",
    "Mrw.eth": "I nominate ThalesItalia for this round of Thales Council.\n\nThales Italia is a close-knit team of several people such as @Mrw.eth  and @andrea0x.eth |  ThalesFun\n\nWe are very united as a team, in daily contact with various voice briefings for organizational purposes.\nOur roles are divided into:\n• Team management: responsible for the main organization and division of tasks.\n• Marketing and research management: researcher of the latest protocol news and disseminator of these on twitter, mirror, discord\n• Human resources : search for people dedicated to our project to expand the team and cover more activities\n• Analyst: search for the best strategies\n\nWe are constantly growing and updating and we are sure we are up to the task to best cover the role of council member.\n\nOur page: https://twitter.com/ThalesMarket_it\nOur address: 0x167ed3fe654a6a4d3F159f6F8a5536e49515b969",
    "padzank | Thales": "Hey hey hey!\n\nI am nominating myself again for Thales Council position. As one of Thales Core Contributor representatives (Strategy Lead) in the Thales Council, I will do my best to utilize my long Thales experience to continue synchronizing the Governance Structure with the Core Contributor developments in both ways to the best of my abilities.\n\nFrom my point of view, we are entering a crucial period of Thales protocol growth. The products are maturing at a rapid pace and are getting more and more recognized as ready for wider adoption. Governance Structure also needs to keep pace with this fact by focusing to further improve the quality and objectiveness of discussions, debates and due diligence around upcoming improvement proposals.\n\nReally looking forward to the Fourth Thales Council and I am certain it will reflect the high quality of our amazing community which I hold in the highest regard.\n\npadzank.eth",
    "Svenska": "Hey friends,\n\nAfter thinking this through in detail, here I am running for this upcoming Thales Council election!\n\nI am a relatively long-time rejoooiner, introduced to the project via those famous 137 tokens.\nI arrived discreetly, read a lot of product documentation and Discord channels, then started to participate in the different events (Tale of Thales, Thales Royale, raffles) and collected almost all the possible NFTs / POAPs / OATs by using all the products created by the team.\n\nBecause of my technical background, I quickly had the reflex to report any issues  as well as ideas for improvement.\nHaving used (and still heavily) every Thales product and taken part in a lot of discussions, I try to use my knowledge to the benefit of newcomers, trying to introduce them to the project in the best possible way. I think this is what helped me to rejoin the Disciples team.\n\nI am a strong believer in the vision of the project and its potential. I believe that the project has the potential to make a real difference, and I am committed to helping make that vision a reality. This is why I try to spread the word as much as I can, through my own CT profile and the French Thales CT account. Again, I think this is what helped me to rejoin the Olympians team.\n\nI not only introduce myself with a self-description but also with a list of ideas, which I would make part of my bucket list of things to push, if elected:\n- Improve communication with council and further encourage ideas from community. Having used it a few times, the current TIP proposal process is not that smooth and I think we are missing out on some great improvement proposals, partly due to this and the current channel governance, which can very quickly see a lot of different topics intermingled and therefore lose track of each idea. I just checked all 109 created TIPs and less than 10 were actually authored by non-CC/council members.\n- Improve resilience on product side. In my eyes, Overtime is a real gem and will quickly come up against some very big established players who will do everything to damage the project. My technical background also taught me to always have backup procedures/tools to compensate for any incident/unavailability of certain suppliers.\n- Strengthen decentralization, on governance side. With the implementation of tools available in case of issues with one or more council members. If my memory is correct, problems have already been encountered twice in the past and this kind of tool could have been useful (recall elections for instance).\n\nThis is an exciting time for the project, and I believe that I can offer the skills and experience that Thales needs to be successful.\nI understand that being part of the Council is a huge responsibility, and I am prepared to take on that responsibility with enthusiasm and dedication.\n\nThank you for your time\n\nENS: 0xsvenska.eth\n@CT: 0xsvenska",
    "MrBreakout": "Hello Thales Community,\n\nAs we are getting closer to end of another council term I have decided to nominate myself again.\nI feel like next term will be a milestone in terms of market move and our adaption hence i would like to keep close eye on every decision made on Thales, of course if you allow me.\n\nSo far, we parked exotic markets and thales royale so that team can concentrate on Overtime and oh boy it was a good decision.  As you know I’am closely following protocol profits and trying to do my best to inform our community and others via twitter etc.\nOvertime became our new hot product and carrying weekly profits single-handedly week over week.\nWe are generating very generous weekly profits every single week during one of the worst and brutal 🍺 market in crypto history.\nWhen tide turns bullish, I believe we will multiply all our metrics so I would like to keep close eye on our protocol when it happens.\n\nCurrently, we are using our protocol profits to buyback and burn our native token but if bull market comes back then I would like to push for distributing our profits to stakers pro rata basis and pause buyback and burn process.\nI would like to support Overtime to become very close to any web2 sports market product and increase adaption.\n\nFor LP’s I’am objective between Velodrome and Arrakis.\nI was cautious about Velodrome at first since they were new protocol and they needed time\nto prove their selves.\nHowever, I see they are making good progress increasing their TVL and user base.\nIn anyway I’am open to test things out as long as we don’t put our eggs on one basket.\nFor me our liquidity should always be divided into two different protocols due to security reasons.\n\nThanks for your support in advance\n\nmrbreakout.eth",
    "Jayref": "Hello hello Thales friends, I’m nominating myself for another epoch as Thales council member. The last epoch has been wild with new products, features, and general expansion for Thales, and I’m excited for what’s to come.\n\nKey things I believe in:\n- Structured approach to evaluating RoI of initiatives, e.g. liquidity pools, which is also why I pushed for a WETH pool on Velodrome.\n- Dedicated focus on community engagement and expansion. With the potential of Thales – and Overtime especially – we need to continue expanding our reach outside of the SNX ecosystem on Optimism.\n- Accelerating UI&UX improvements. As our product features mature and reach parity with the competition, it’s important that we keep excel in UI&UX as that’ll be a core point of differentiation, whether the competition is crypto options protocols or Web2 sportsbooks.\n- Being mindful of opportunity costs. Plenty of opportunities out there for Thales, but the massive potential of the protocol means the importance of keeping our eyes on the ball cannot be overstated.\n- I am most excited about the prospect of Overtime going multichain via cross-chain communication so liquidity and oracles can remain concentrated on Optimism. The upside of bringing the best odds in the biz, non-KYC, to a much wider audience can hardly be overstated.\n\nThank you for your consideration, looking forward to seeing what the future has in store for us!\n\n0xe73304c94da7f7b32d86199bc967299da2a0fc19",
    "Cvija | Thales": "Hello everyone,\n\nMy name is Cvija, and I have been a Thales Core Contributor for more than a year now (since the 1st day of the new Discord to be exact). I hold the Quality engineer position, and I am in charge of keeping a high level of functionality, reliability, and usability of the dApps of the Thales protocol. Due to the fast-paced development and the interactive nature of our community, I often pivot to the product or user side and try to be a sort of bridge between these two.\n\nI have been in the tech industry for the past 5-6 years, yet I have never seen a space that is evolving and expanding as rapidly as this one. This is something that sets us apart currently, and I think both swift governance decisions and development need to continue.\n\nWhy do I think I am a good fit for this role?\nI know the protocol in and out, including all its current developments, challenges, and plans.\nAlso, this would not be my first trial in a governance role, since I have already done two successful elections periods as a part of the Oracle council\nAside from being a CC, I am an active community member, participate in Agora discussions, and have written and co-authored a couple of TIPs.\n\nDuring my possible tenure, I am looking forward to providing the users of our dApp the best possible experience, both by making our UI smoother and easier to use (improved mobile experience and handling RPC issues to name a few), but also pushing for new functionalities that our web2 counterparts are offering, like new market types and frequent incentivized campaigns.\n\nAnother very important thing to tackle is enabling external LPs, which would allow us to accommodate a much larger audience or larger individual traders that do not feel their needs are met. This will open up our AMM to a much larger volume, which will result in increased fees. If large enough, these could be distributed to the stakers, fitting nicely into the popular \"real yield\" narrative.\n\nIn my opinion, Thales and Overtime are just starting, I am eager to contribute to the growth of the protocol from yet another perspective. Either way, all of the candidates for this election are great choices, and I am sure that Thales is in good hands. Cheers!\n\nENS: cvija.eth",
    "cyberduck": "Sup fam!\n\nThrowing my flappers again in the ballot list. Overall I think the protocol is  well steered and does not require any significant deviation from the current path, so I do hope that as governance we'll continue being effective and analytical in due diligence and decision making and not become a burden upon the awesome core contributing team that's building and delivering at an impressive rate.\n\nAs a personal challenge in the upcoming epoch, I will be proposing an integrator project that seeks a council's grant approval . I believe the success of Thales / Overtime is not to be solely dependent on inhouse applications, but as a protocol should thrive  to be composable and to attract new products to be built on top of it.\n\ncyberduck.eth"
}
