{
    "cyberduck": "Your favorite duck is flapping his wings again to agitate for your support. Past 6 months I've taken a liking to Thales and its products. I have subsidized Royale markets and the AMM with plenty of losses. With experience I am starting to understand what it takes to keep someone engaged with a loosing streak, and that's what we need, more degens like me. My favorite products, albeit not in $volume are the exotic markets, having set up multiple hockey markets and participated dozen others. I am super excited for overtime markets and I'm betting on that being a good driver of retail attention in the future, assuming we tackle the onboarding friction and deliver a UX that does not scare. I'd love to be able to help in any capacity, even beyond what's expected from a council member for another epoch to bring adoption and ultimately value accrual for token holders.\n\ncyberduck.eth",
    "BigPenny": "Dear Titans! A friend once told me that wishing someone to 'live through interesting times' is a polite way to curse them in some cultures. We surely do live in 'interesting times' right now and there is no telling how much more 'interesting' it will get in the coming months. Times like these are what separate the wheat from the chaff.\n\nI am very bullish looking at THALES and I have litterally 0 worries about THALES surving the current recession. While other projects blow up and people flee in droves, we are literally welcoming the opportunity to test our AMM and improve the logic to make it more robust for the future. The amount of high quality services that THALES has launched during the last 6 months alone is more than most DeFi projects manage to build in two years and there is still more to come. As long as DeFi as a whole survives (and for me there is no doubt that it will), THALES will be mighty fine and come out way stronger than most others.\n\nFor the upcoming epoch I want to focus on rewarding those that stick with us during the harsh times and make tokenomics more robust for the protocols long term health and success. Those won't be dramatic changes but iterative fixes to issues and applying some lessons learned from the past 6 months. In regards to protocol services I am excited to support both the dev team and Oracle Council as much as I can on the contract and metagovernance level. The current market situation does give us valuable time to find solutions for unsolved issues, like scaling of our non-AMM services. As far as marketing goes, I want to be more open to new ideas than I was in the past and enable experimentation and improvements to user acquisition and user retention. I know there are community members among us that have both the qualification and the conviction to drive protocol adoption significantly if we give them the ressources to build now, so we are ready when the next bull cycle starts.\n\nOn a more personal note: I lived through pretty much the worst time of my life during the past couple of months and that resulted in me intermitently acting towards people I love, respect and cherish in ways I deeply regret. I want to apologize to everyone I have treated unfairly during discussion, especially @Danijel | Thales  and @padzank | Thales  who I gave the hardest time of all. I want to thank the Thales Team and the Thales Community for bearing with me during that time and for treating me kindly, no questions asked, after @dmonkey | Thales managed to snap me out of it by literally owning me with facts and logic. (Free boomer meme!) I now know for a fact that my love for the Thales Community is mutual and I would be honored if the Thales Community would allow me to serve another 6 months on the Thales Council. Nothing fulfills me more than the opportunity to help make THALES the most successful project on Optimism!\n\nWallet: ancientgreekfrog.eth ",
    "Red | Thales": "Last epoch on the Thales council was my first taste of decentralized governance as a council member, and I believe I have brought great insight and feedback to the multiple TIPs we have seen over the last 6 months. On top of this, with the help of @beachmom | Thales 'How to write a TIP' article, I have written my first two TIPs in the previous months, and I am here to keep on-boarding members into the Agora. Focusing on community requested features such as account merging, phase0 distribution, exotic markets, etc., as always, my goal is to represent the dedicated members of our community.\n\nAdding to this and looking at the development pace by our team I believe it is important to have council members that are knowledgeable of our protocol. As a Thales core contributor, knowing the ins and outs of Thales and its community is a big plus, and I believe I am an ideal candidate to operate under the current healthy governance model we have. We have big things coming up in this next epoch and I believe your vote here is more important than ever.\n\nwallet: 0x752cdfdffaeebe73bb1388f69f94553ade64c988e",
    "Jayref": "Greetings fellow positionoors,\n\nAs a Thales Royale permabull, I’m no stranger to pain, disappointment, and bera bashings. But even then, the last few weeks in the markets have been truly dark and depressing for many of us. Thankfully, there are a few lights in the dark, and a massive one is the incredible pace of product development and community spirit I’ve seen in Thales. We’re at the very early stages, and I’m incredibly excited and bullish about how far we can take this, and so I’m throwing my hat in the ring for Thales Council \n .As a community member, I play an active part, always staying on top of this Discord and promoting the great work of the team, whether in Discords, on Twitter, or elsewhere, and am highly persistent in my donations to the AMM. \n\nI’m excited about the prospect of joining the Thales Council, as I find the product originality, innovation, and general accessibility is like nothing I’ve seen elsewhere. \nI believe we have an incredible opportunity to bring Thales to not just the hardcore options-trading defi community, but to a much, much wider audience via products like Exotic Markets and Overtime. \n\nWe may be small now, but if there ever was a crypto protocol with the potential to become a household name, it’s Thales! \n\nAs a council member, I believe in being transparent and communicating directly and honestly, even if the opinion is unpopular. \nFor the coming epoch, I believe we should actively strive to not just grow our mindshare of the larger Synthetix ecosystem, but think even broader still. We’re in the fortunate position of being a unique protocol with original, innovative, and decentralized products, so I feel confident that we can grow user adoption a lot with a focused and creative communications plan. We should also continue to focus on making the UI&UX more intuitive, as it will be key to product adoption by a wider user group.\n\nWhether Thales Council or not, I am highly appreciative of this community and look forward to seeing what the next epoch holds in store for us. \nLet’s get it to $91 \n\nWallet: 0xe73304c94da7f7b32d86199bc967299da2a0fc19",
    "ramblers99": "Fellow DeFi Summer 2.0 survivoors (so far):\nI am once again asking for your support for another epoch on Thales Council. Regardless of the current valuation of the token, I am substantially more bullish today than I ever have been in the past. I take pride in representing the avg non-technical user and savvy investor on the council.\n\nWhat you can expect from me:\nI try to keep my written opinions on TIPs quite brief and to the point, and I always state my reasoning before I vote. However, I am certainly not afraid to push back or seek clarification on any issue.\n I will be timely with my votes. I travel often, but keep council in the loop on 'extended' timeframes away (rarely over 12 hours/flights). My opinions will also come later in the discussion unless I truly don't understand the TIP or need context early on.\n\nMy current stance on Thales (project), $Thales (token), and the future:\n1. The Thales project imo, is about to enter an entirely different stratosphere with sports positions (Overt1me). We have but a small window to make a big lead in this decentralized space. I am very much motivated to incentivize customer acquisition!\n2. Governance tokens need to do more than elect me! The current council and team have been very open and able to pivot on creative ways to bring value to the token. If the governance token model survives it will only be because of teams like ours that adapt and drive value. I will do everything I can to ensure that happens long term. Sometimes that means making uncomfortable decisions that impact the short term and/or partnerships that are deemed not sustainable for Thales.\n3. The future is bright in crypto! I am not a moonboy but I am certainly permabull. We need tokenomics that capture true value and we need customer acquisition and easy on-boarding... just like all of DeFi. We just happen to have the best team to pull it off.\n\nWe are building something special here and my DMs are always open to hear your input.\n\n- Seth\nwallet: Vote4S.eth",
    "MrBreakout": "Dear members of coolest protocol in DEFI,\n\nTime flies and it is election time again !! Hence, I'am nominating myself for Thales council.\n We are going through tough times with unseen level of negativity and sell off in crypto markets. \nHowever, I believe its best time to build, extend our reach of user base and community.\n\nFor people who don't know me, I'am Enterprise Software Techno - Functional consultant transitioning into crypto, active member of snx protocol and heavy defi user overall since early days of uniswap.\n\nDuring my last council position, I tried to read, digest, discuss and ask about every TIP submitted to us. \nI never missed any votes and did not hesitate to contradict with other fellow council members to keep my ground. I'am getting involved more and I already got voted and approved TIP thanks to @Cvija | Thales.\n\n As a summary, I would be more than happy to contribute thales in any capacity I can again.\n\nWallet: mrbreakout.eth\nCT: @IamMrBreakout",
    "padzank | Thales": "Hey Thales Titans!\n\nI am officially nominating myself for the Thales Council to continue participating in the growth of the Thales protocol from the front lines!\n\nWe are finally maturing as a product, all pieces are falling into place and we are on a brink of an explosive growth phase. Now more than ever we need a focused and efficient Thales Council who will help steer the products (YES THATS PLURAL FOR PRODUCTS) in the optimal direction.\n\nNew easy fiat and cross-chain onboarding, exponentially better UX with multi-collat support, novel types of markets exposure, worlds first on-chain Sports Markets AMM (thanks Chainlink), successful novel Exotic Markets solution, best Referral Program solution in the game and we are just getting started.\n\n As a Strategy Lead Core Contributor and, above all, a passionate community member I am fully motivated to continue working together with the community and the fellow Thales Council members to continue with the upwards trajectory.\n\npadzank.eth",
    "milkywave (🥛🌊)": "So I guess I will start again....\n\nheyhey positiooooooners!\nCrazy how fast time flies! We already have the first 3 months as Oracle Council behind us. First thanks to the first OC! I think you/we did a great job!\n\nI would like to summarize my highlights of the first epoch as part of the OC:\n -Preparation for launch, tested different scenarios, fixed small inconsistencies, adapt guidelines\n -Launch on April 27th 2022 :lfg:\n -Fast processing of the disputes that have arisen\n -Actively supported the community in creating new markets and general questions\n\n The first 3 months I would definitely call the 'teaching phase' and in my opinion:\n a) the understanding of the exotic markets has increased massively\n b) the quality of the new markets has increased\n c) the oracle council has done an excellent job, especially concerning the reaction time!\n\n I think I can make an important contribution in the Oracle Council and I am convinced that the exotic markets will really take off in the next 6 months. Therefore I would like to nominate myself again for the OC election and would be happy to get your vote!\n Cheers 🥛 🌊",
    "Weston Nelson": "Greetings to everyone here in the Assembly of Thales. I am feeling quite enthusiastic and honored to have been nominated for the responsibility and opportunity to potentially join the Oracle Council! \n\nA sincere thank you to @BigPenny :thales_blue: \n\nFor my pitch: I wanted to share a little background about me, why I believe I would be an excellent fit contributing in this manner, and last, my qualifications and skills I can bring to Thales to support growth.\n\nTo start, wanted to mention I just get a really great vibe from the community here and this is an intangible thing but one I felt worth mentioning for sure. I have seen a lot, and It feels like one of the best in crypto and I LIKE IT! Contributing more to that would be a huge joy to me as I love promoting DeFi and especially novel/new primitives like Thales and Exotic Markets. I believe strongly that small groups of people can do massively large things with focus and determination, and this is something I see happening with Thales. \n\nMy qualifications: Over 10 years experience in financial markets. Started my career in TradFi as a Financial Advisor…I would say I learned the most from the couple years I spent with Fidelity Investments, where I worked as an Investment Consultant. I have a thorough and deep understanding of derivatives, trading strategies, and crypto assets. I have been full-time in crypto for the past 2+ years primarily just trading crypto and researching markets and more recently, learning to write code in order to trade programatically. \n\nI think the Oracle Council is a natural fit for me when considering the architecture of Exotic Markets. I feel this role would ideally be made up of people who are reasonable, open-minded and can demonstrate sound judgment in sometimes very gray areas, which can be tough; and I think this is one of my strengths that I can bring to Thales in terms of resolving disputes, moderating Markets, and ensuring the health of Exotics is watched over with a close eye.\n\nIf I were to be elected to the Oracle Council I would do my best to go above and beyond  to contribute to Thales success by success by utilizing the unique package of skills I’ve acquired over the years in traditional finance, decentralized finance, community building, smart contract security and development, trading and tokenomic design, and researching the overall crypto landscape… and strive to bring as much traction as I possibly can to Thales to positive benefit all parties involved. \n\nMy intentions long term are to be a top notch smart contract developer and so this also aligns very well I believe. I also have enjoyed being a part of this community, the Royales, holding an up position on Luna on May 12th, and chatting with everyone in here has been awesome - feels like the right place for me to contribute and I would feel it to be a true privilege for me to be become a member of the Oracle Council.\n\nI also would like to nominate @BigPenny for Thales Council, @Red | Thales for Thales Council and @milkywave (🥛🌊) for Oracle Council. I am super pumped for Thales, Exotic Markets, and see immense potential here to build. The crew seems nimble and sharp, and dedicated to all the right things, which I value very much.\n\nSincerely,\n\nWeston Nelson \nWallet: westonnelson.eth",
    "raffiegang": "Hello fellow gambl<oops>positionors!\n\nFor those that already know me: 🏝️ I’m just an island boiii  🏝️, for those who don’t: I’m raffie, Thales OG, and fanboy from the start. I’m involved and interested in anything Synthetix related.\n\nI’ve already had the honor to serve this epoch as a member of the OC :crystalball:  , and in that time I have learned a great deal (shout out to my fellow OC members) about the subtle art of exotic market making and dispute resolution... And either despite or because having served before, I’d love to bring it again for the following epoch. \n\nServing for me means, I’ll be:\n\n- having an eye on markets and their integrity; \n- resolving disputes asap;\n- striving to create or helping create the first open bid market that will explode volume wise;\n- helping out wherever I can in other areas; for example through building something (this epoch I built an URL malware check solution for exotic market data sources - still to be deployed)\n\nGood luck to everyone running!  Also vote for me! \n\nRaffie\n\nWallet: 0xF9bD5bdE14733C88FF763a9818AF69c3700FA021",
    "DeFiCandy": "Hello my friends, \n\nFirst a BIG thank you to those that urged me to run for Oracle Council. I wouldn’t be writing this without your support.\n\nWho am I? Well, despite being pseudo-anon (doxxed to Thales team member), I’ll share a bit about myself. IRL I’m a motion graphics artist and entrepreneur. In English that means I work on designing and animating movie titles as well as graphic animations and VisualFX for commercials, video games, etc. I have served as Art Director for one of the major broadcast corporations and have also built my own boutique motion graphics agency (which I’ve since sold because of client headaches and I just love creating). I’ve also played sports, mostly hockey, my entire life and love anything related to sports numbers and prognostication. From creating my own prediction models to good ol fantasy football, sports + numbers fascinates me. So what’s this got to do w crypto? Well, nothing, I was just telling you about myself IRL. BUT, my love for design and sports are not my only passions. My other passion is in numbers and logic, hence crypto. I was first introduced to crypto around the 2017/18 bull-run. I was intrigued by Synthetix and then found the Synthetix Discord and “Degen-Trading” channel and knew I was home lol. Seriously though, I found the ethos of DeFi to be SO refreshing. Seeing communities working together to build a level financial playing field honestly restored my hope for humanity. I’ve met so many amazing people and groups over the years but none have compared to the Synthetix family. As I’ve recently “come back” and gotten more involved with Thales it’s been heartwarming to see so many old familiar names from the community now in governance. It truly is a governance of the people, as it should be. It feels like destiny that this community I love has evolved into Exotic Markets and is about to launch Overtime, a product so similar to a vision I had years ago that I’ve never let go…\n\nSo beyond the amazing community, the other aspect of this that really excites me is that I had a vision of a DeFi sportsbook back in 2018 when I was first learning how block-chains work. It was a lightbulb moment where I realized that with the use of this new technology, one could create a sports prediction market with almost no juice… It would be very possible to offer the BEST odds, and if that's not enough, the players could possibly get any kickback that the protocol does make! Win-win-win! I followed projects like Auger for a bit as they tried to build something like this vision, but nobody was able to create it. It was a bit shocking to me. In the meantime, sports betting has absolutely exploded! (at least/especially in the US). US News reports Americans have bet 125 Billion dollars over the past four years…  And guess what, we can still use our on-chain advantage to beat the companies like Draft Kings and Fanduel who are taking most of this profit. So yea, I’m really really excited about this protocol to say the least.\n\nI’ve always thought of myself as a small fish in the crypto world. This is partly why I never expected to be running for a governing role. However, I’m realizing I have been in this game for a little while now and I should be a bit more confident in myself. I’ll always be the first person to admit what I don’t know. I’m not afraid to ask basic questions and admit when I’m wrong or uninformed. These values should transfer well to a governing role. I’ve also gone over the Oracle Council responsibilities a few times and I know that I could meet and hopefully go beyond the expectations set there. With this background of sports prognostication, DeFi, and some high end marketing, I would be honored to serve on the Oracle Council and do everything I can to ensure we have the best markets possible, driven by the community.\n\nI will always make myself as open and available as possible. I will always act in the community's best interest. I would be honored to get your vote and take on this responsibility as an Oracle Council member. I sincerely thank you for reading this and please don’t hesitate to ask if you have any further questions.\n\nCheers!",
    "MiLLiΞ": "Hey everyone,\n\n I'm going to nominate myself once again for the Oracle Council! It has been a pleasure to serve for the past epoch among the other council members and I can't even begin to say how impressed I am with the efforts of all Thales contributors over the past several months.\n\n During the first epoch I felt like I was able to bring a lot to the table and help Exotics get off the ground, particularly in the pre-launch and early beta-phases. Since it's inception Exotic markets has had some great improvements that made for a better user experience and more robust mechanics. There's still lot's of work left to be done however, and I'd like to see Exotic markets reach a level of scalability and adoption that makes it a strong competitor in the industry. \n\nFor the next epoch I'd like to continue helping Exotics improve and continue monitoring disputes to ensure the mechanism is functioning as it should be. Additionally I want to help usage of Exotic markets really ramp up and see the $OP distribution that will be allocated for it to be used efficiently in bootstrapping campaigns until we get there. \n\n I have many ideas I think we can explore with Exotics and I'm excited for the opportunity to be involved with it's growth! \n\n Cheers fellow Greeks, thank you all for your support so far and going forward! \n0xmillie.eth",
    "Cvija | Thales": "Hello friends, it is my pleasure to write here again. \n\nI am sure more of you got to know me since my last pitch, but I will try to sum it up once again.\n\nMy name is Cvija (tsweeiya), and I am a Core Contributor at Thales. I am also a member of the first elected Oracle Council, serving with four other friends from our community, which has been an absolute pleasure.\n\nSome short info about me:\nMy background is mostly Software Quality, working with development teams on complex financial products, handling and prioritizing new features and improvements, and getting familiar with the product and industry as deep as possible.\n\nAt Thales, I have a similar role (I also do some shitposting, yes :kek:), but what I feel like is different here is the direct and spontaneous connection with all the community members, people willing to give you honest and helpful feedback and ideas with the common goal of improving the protocol.\n\nThis has been the case especially for the Exotic markets, because the mechanism behind them is kinda new, and all kinds of unforeseen situations could have come up.\n\nAs a member of the Oracle Council, I think we as a team did a pretty good job - helping out with testing new features, with writing the guidelines, giving feedback on possible markets, and most importantly - handling disputes in a very timely fashion and in complete agreement. \n\nWhat gives me the confidence that Exotics will succeed is a slow but reliable influx of new community members, showing passions and willingness to take on responsibility, be it in promoting, creating markets or offering their help in other ways. The other thing is that we are all aware that we cannot stop here and that we need to continue to build, promote, incentivize and deliver, regardless of the current market situation.\n\nUsing my close involvement with both the other team members and the community, my main goal continues to be taking the platform to a whole another level, and I would be honored try and do this as an Oracle Council member once more.\n\nThanks everyone! \n\nENS: cvija.eth ",
    "JVK": "This is my TC self nomination.  My public wallet is jvk.eth.\n\nI was active on the OG Thales discord but lately less active here as I was occupied with being a new SC (Spartan Council) member and being involved at another DAO as well.\n\nIn governance, I tend to be somewhat conservative and focus on what I view to be the long term health of protocols vs short term gains.\n\nI am generally liberal re things like pursuing partnerships and cross promotion outside of protocols.  I think they need to 'network' just like IRL somewhat.\n\nIn addition to SC, I'm still on council for Kwenta Interim Council too.  However, most of that epoch work is done as we are mainly waiting for DAO launch and new elections there soonthetix.\n\nWhether we are in crypto winter or just a dip it doesn't matter to me that much.  I'm in this for the tech. :)   My day job is a practicing attorney with a background in IT and accounting/finance and my day job even includes crypto/forensics sometimes, which is how I first got exposed to it.  I also  started learning about it through various personal connections who work full time for crypto projects too.\n\nI have always liked Thales and think there is an amazing protocol being built here that needs to find the right audience.  I'd be happy to help make that happen however I can.",
    "Coa | Thales": "Hello friends,\n\nI am going to nominate myself for the next epoch of the Oracle Council.\n\nMy name is Coa and I am Core Contributor at Thales. As a member of first elected Oracle Council I enjoyed working with OC team together :greekpepelove:  (Checking newly created markets, resolving the Disputes, resolving Markets...).\nIt was pleasure and I have learned a lot from you guys.\n\nBefore I joined Thales I was working as QA engineer for more than 5 years, testing different kind of softwares and Apps.\nMy role is similar at Thales but more interesting because of direct connection with all community members.\n\nMy previous experience as QA, involvement into Thales protocol and part of firstly elected Oracle Council could be benefit for the next epoch as well.\n\nCheers and good luck to all nominees!\n\nCoa\n\nWallet: 0xe966C59c15566A994391F6226fee5bc0eF70F87A",
    "ΔLΞXΔNDΞR": "Hello Titans. I'm nominating myself for the Oracle Council. \n\nMy qualifications: \n- Synthetix Grants Council member\n- Thales Royale Winner\n- Community member & meme maker\n- I can pronounce Thales correctly\n\nOh and did I mention I'm a highly-motivated, detail-oriented, strategically-minded, team-playing, results-driven, synergistic, go-getting, outside-the-box-thinking, thrill-seeking, agile rockstar ninja?\n\nWallet: themerge.eth"
}
