{
    "JVK _/": "This is my self-nomination for Thales Council.  Thanks to @Danijel | Thales for the encouragement to run.\n\nMy address is: jvk.eth\nCT: @jay_veekay\n\nThales involvement: I am a Disciple of Anaxagoras having won the vote for that group in the \"deprecated\" discord.  I own two Thales NFTs including a 1/3 \"Thales market creator\" and agreed to gift the balance of the NFTs back to Thales at the time for the future good of the protocol.  Other SNX community involvement: Interim Council at Kwenta; 300 at Synthetix; and, Aegis (Mod) at Aelin Protocol.  Am also currently running for SC.  Other crypto community involvement: Moderator and Dog Pack Leader at Tally (the forthcoming wallet extension/DAO) and \"12th Man\" at LeagueDAO.\n\nMy day job is as a practicing attorney whose work sometimes involves crypto, which is when I have to work extra hard to hide the degen.  I also have some IT and accounting/finance background as well.",
    "ramblers99": "Thank you @Danijel | Thales for recognizing my activity in the community. I came to Thales (as an investment first) specifically because of your leadership and your team's ability to ship. Everything since has surpassed my expectations. I share with @pkwn888, @Deckard, and @CT  ⚔ in how they feel in not seeming like a perfect fit or skilled enough to be considered for a spot... and that's exactly why I'm nominating myself for Thales Council. I am of the belief that there is a large active part of this community that is not of a developer/tech background, and simply is a savvy investor and disruptoooor in their own field. I absolutely want that voice represented on the Thales Council. With it now 7 members, I certainly believe there is a seat at the table for someone like me and I encourage the above tagged names to reconsider. That being said:\n\nMy address is: Vote4S.eth\nCT: @SethVanderLaan\n\nThales involvement: I am a proud rejooooiner who came into the project with nothing more than 136 airdropped Thales for staking on L2 in SNX. I researched. I sat. I watched. I learned more about the project every day. And then I bought the generational bottom around $1.50 (ok, $1.33 was the bottom but I had to confirm). I have been staking since week 1 and have daily activity in the discord. Full investor transparency, I will sell Thales along the way as the market dictates. I strongly believe in this project/team, and will always have a stake, but that needs to be said as I want to represent similar minds.\n\nOutside: Being an early DeFi adopter now allows me to run my own consulting company and travel the world for street foods. I spent years as an executive chef for a professional baseball team and have years of experience in the casino industry. I have been on many corporate committees and am highly recognized in my industry. I get things done.\n\nI'm Seth VanderLaan and I approved this message\nWAGMI",
    "BigPlutus (BigPenny)": "Address: egyptianfrog.eth\n\nI’m nominating myself for the Thales Council. My involvement with Thales started very early after the projects inception. Being a spin-off of a much loved but sadly neglected product of Synthetix, I was eager to see what a dedicated Team lead by Danijel could achieve with binary options. I was one of the early beta testers of the Thales Market and when I saw what the Thales team has created, I was blown away. This did not look like a simple spin-off! This was a complete re-imagining of what binary options can (or should) be! Being a fan of prediction markets, I quickly realized that binary options are right up my alley and I quickly started to have... FUN! I know it sounds crazy, but a lot of things in Crypto, while being very profitable, are simply no fun to do. It’s a grind, boring and exhausting. Thales however, was immediately great fun AND profitable. (Okay, it was testnet money at the time, but you get the idea.) This is when I realized the true potential of Thales and its team. They had figured it out and I was hooked! \n\nParallel to me testing Thales, I was engaged in the freshly baked community early on and applied to become a Disciple to help as much as I could. Many familiar names were already present and Thales was carrying their relationship with Synthetix proudly in front of them. There were many individuals which I highly respected from working and talking with over at Synthetix and I quickly became familiar with a lot of new fantastic community members, some of which I might have driven a bit crazy with my many suggestions for the website. (Sorry Gorstak! 😅 ) It was great fun to see how Thales quickly developed its very own style and memes and overall community feeling. \nDisregarding some difficulties I had with a certain someone which lead to me losing my Disciple role, I kept close with the Thales community and tried to support the project the best I could. At the time Sanguine and I got to know each other and he started helping me with a lot of smaller and bigger art commissions. I quickly noticed, that Sanguine was different from most people: He always delivered way ahead of time and the results were always perfect. When I learned that he actually does game development for a living (games = fun) I knew who I had to contact. It was not easy to convince him but I am very happy that Sanguine is now part of the Thales team! I also started to wrap my head around why Thales was so much fun to use and how it could be made even better and what we could do besides “simple” binary options. This lead to lots of discussions both on the Discord server and in DMs. Looking at the “The epic journey continues” blog post and the Thales Whitepaper, I was happy to see that the Thales team also thought in a similar direction like I did, so I felt comfortable to continue giving input. Gamification and Parimutuel... I mean Positional markets are the logical next steps for Thales and with the first Thales Royale now concluded I’m sure everyone has realized how entertaining DeFi can be. \nMoving forward to the present and my plans for Thales: Similar to Thales growing and evolving, I have changed quite a bit as well. I have met many new fantastic people, one of which is Beachmom who I again was able to recommended to Thales. After almost a full year of trying, I was finally elected into the Synthetix Spartan Council thanks to the continued support of a lot of people, many of which I consider close friends. Being on the Spartan Council taught me a great deal of skills and allowed me to engage with and elevate the community in ways I would have not imagined before.\n\nI worked hard on making the Synthetix governance more public and more accessible, something I think is necessary for Thales as well. Thales is very community driven already but the actual council is not visible enough. I want public council discussions with active community participation as much as reasonably possible. That means: Everything should be public, unless it would endanger the security of the project, like security vulnerabilities for example. Those shall be kept private, until fixed and then must be made public in a post mortem to the community.\n\nI also want the Thales Council members to engage more with the community in general. I can’t force anyone on the Council to do anything but what I can do is promising that I will be there right with everyone else in the chat and accessible both in public and private DMs. I’m sure there are a lot of people who will happily confirm that this is what I have always done and never stopped doing. \nPlanning more long term, I want to try and create something similar to the Spartan 300 community effort we have at Synthetix. It might be a bit too early for that right now, but based on my experiences with that format and the incredible long term community participation it creates, I don’t see any reason why Thales should not as well tap into the massive potential that our community holds. An organized community effort not only creates tangible value from marketing, documentation and teaching each other valuable skills and knowledge sets. It also creates an extremely strong bond within the community where every individual can experience a strong feeling of affiliation with the community, the project and everyone’s contributions to them. \nLooking at the tech side of things, the most important task right now is to move Thales to Optimism as soon as humanly possible. Both the markets as well as the staking infrastructure. I know that market wise the Team is well ahead of things already and is/was mainly constrained by third party dependencies not being available on OP yet. However when Thales is finally on Optimism, things are actually just starting to get interesting. With low gas costs and quick execution times, a whole new world of possibilities opens up to us. Custom markets beyond asset prices are just one of many ideas which are already discussed in the community, however those come with new challenges, especially in regards to how the final results of such markets are determined reliably without any ambiguity. The community already discussed man different ideas to tackle this particular question (Did I mention, that Thales is very community driven? 😉 ) but the solution will ultimately be decided by the Thales Council. The way how Thales will handle new custom markets, from who and how they are vetted, approved and decided is one of the most important decisions the Thales Council will make in the near future and it will have significant impact on the success of this project. \n\nI would be honored if you, the Thales community, would give me your vote and allow me to help shape Thales into the successful, uncensored and community driven project we all want to be part of!",
    "redmarglar _/": "Thanks @Danijel | Thales for planting the idea in my head to nominate for the Thales Council. I would like to accept the prod and self-nominate 😀 \n\nI've been interested in the potential of decentralised binary options since they were first released on Synthetix in  2020. where I'm from sports betting is massive and even a small chunk of that market would bring huge volume, so I was really excited when Thales was spun out of Synthetix with its own group of CC's. I think it's fair to say that it's exceeded all expectations so far. The user experience is fantastic and with L2 around the corner and innovations like Royale I'm confident we'll see a big influx of volume. that means we need to continue to be well governed.\n\nI'm currently a Thales disciple and have been pretty active in both the old and current Discords. elsewhere in the Synthetix family I'm on the interim Kwenta Council and also currently running for Spartan Council. although I'm relatively new to DAO governance I've been in traditional organisation governance roles for many years, including small not for profits, companies and a stint as a city councillor. I've recently gone part time at my day job at a not for profit so I can increase my crypto and DAO involvement.\n\nI'd be very honoured to be on the first Thales Council elected by THALES holders.\n\nENS: redmarglar.eth",
    "Jaxcrypto _/": "I'm working as Product Elite over at Kwenta, as well as being guardian for Synthetix, ive been involved with Synthetix from the beginning and have watched this ecosystem expand further than I could have imagined. I've been staking Thales since the start claimed retro rewards and also bought a significant bag to stake, can't wait for the move to L2.  Im sure I can provide some help to the Thales council and believe that's its in our collective interest for community members to put themselves forward for these positions. With that in mind I suppose there is no harm in throwing my hat in the ring, I would certainly devote as much time as I can to the position, I am fully aligned with the interests of the project and I'm always happy to learn particularly from more experienced guys on the council. \nSo if you would like to vote for myself then please do!\nThanks for your time and consideration.\nTo Thales future success 🍻\n\nAddress: jaxcrypto.eth",
    "MrBreakout": "After thinking about this in detail I decided to run for council since I’am retiring from my full-time job end of this month and I want to get involved more in crypto ecosystem.\n\nI’am a die - hard community member in synthetix project more than 2 years. I believe Thales is an important part of synthetix ecosystem hence that would be privilege to work for this project. \n\nI worked in IT industry more than 15 years as an Enterprise Resource Planning techno-functional consultant for large scale companies . As a side gig, I did release an App in past which was downloaded more than 250k in 3 months.\n\nI’am a heavy DEFI user and SNX Staker since early 2020. I got deeply involved with Funfair project in past so I had a chance to closely observe what works and what not for crypto gaming / gambling ecosystem.\n\nI only have basic knowledge about smart contracts and EVM but I believe I can add value about product testing, UI / process design and user acquisition.\n\nI believe Thales has a huge potential and I would like to make sure it gets the attention it deserves in future. Thank you Dan for noticing and encouraging me \n\nWallet: mrbreakout.eth\nCT: @IamMrBreakout",
    "Red | Thales": "Hello everyone, \n\nAs a member of the Growth team here at Thales I nominate myself to the council. Over the past three months here, I have played an advising and support role on a part-time basis. I bring representation from our Core Contributors and 3 years DeFi experience to the table to help shape Thales Governance. \n\nComing from a non technical background, and more from a human focused industry, I can help support the learning and communication of our governance model/TIP. I used to lead sea kayak expeditions for work, and I believe that a strong leadership model starts by the inclusivity of everyone, or as much as one want to participate. Encouraging others to voice their ideas, concerns, and  feedback is a path to a successful governance. \n\nAs for my experience in this field, I started my DeFi experience playing with quick option trading on mainnet around 3 years ago with a dApp that was similar to speeds round of Thales Royale (I forget the name of it). Always believing in the Ethereum adoption and the vision of our current DeFi ecosystem, I joined the SNX family 2 years ago to embark on a journey that is now still ongoing. \n\nSince then, I have had multiple positions with different protocol in the industry, some where I am more proud than others. From content writer for Swerve.Finance, to being a Risk Harbor Admiral, and now part of the Thales team, I am excited to play a bigger part in the DeFi industry.\n\nThales is a protocol that is here to stay. When I first started playing with our positional markets trying to bet against Spreek on the Olympics I immediately fell in love with what we were building. Like many of you said after Thales Royale, this is the best of DeFi. It’s something engaging and fun to do rather than simply staking, or trading. \n\nI am here to represent Thales, the community, and to listen to what new members have to say.  Thank you for taking the time to read, and in hope that we can work together in the future.\n\nWallet : Pacific.eth\nCT:  RedArctic",
    "mzur": "Hi folks!\n\nThanks to @BigPlutus (BigPenny)  and @Danijel | Thales to make me comfortable enough to nominate myself for the Thales Council.\n\nI was joining the SNX ICO (Haven) in early 2018 and playing around since then in the ecosystem of Synthetix – Would call myself an SNX OG.\nIt was lovely to see many new projects being built around SNX over the last 12 months. Everything started with a \"simple \"idea and now the first Thales Council will be voted. As an active member of the 300, I have got a lot of insights and ideas and I guess it’s the right time to make a step forward to commit more!\n\nAs most of you already know, I’m pretty active on all SNX ecosystem discord’s and try day by day to help wherever help is needed and increase the quality here and there.\n\nsome info bout my \"other life\":\nI’ve got some deep accountant knowledge as I was working for one of the big 4 international consulting companies for a few years. \nFor about 10 years I'm working as a PL for a huge international press house and I am responsible for a 600M Project now in the AdTec Sector - which means I'm super coordinated and understand things quickly.\n\nIt would be a honor for me to catch that chance! \n\nWallet: zueri.eth",
    "cyberduck.eth (rubber^duck)": "I caved to peer pressure.\n\n Here is my simple ducking pitch for the Thales Council. \n\nDAO experience\n- 1.x epoch long Synthetix Spartan Council member\n- 4+ epoch long Synthetix Grants Council member\n- first time Kwenta Product Elite\n\nIRL experience\n- 8+ years as project/program manager in a Fortune500\n- 10+ years a web2 dev agency owner\n\nCrypto general\n- from 4 to 6 digits trader / investor in about 3 years\n- moved all my activity from CEX to DEFI\n- experience with the first decentralized Augur predictions market, which had an awful on-chain UX and seems like they are pivoting to something better now\n- experience with Polymarket as another competitor\n\nIn any case, Thales definitely has competitors, but I am never a believer of the single winner takes all premise, thus I am confident Thales will have its piece of the pie. With the commitment and innovation the community here is delivering, I see a lot can be achieved with a focus on great UX, innovative markets and gamification (Royale), and effective marketing and community management. \n\nWith that said, in or outside of a Council position, it is and will continue to be my pleasure helping the Thales fam achieve growth. \n\nDid I say I like ducks? 🦆 \ncyberduck.eth",
    "padzank | Thales": "Hey Titans \nHere is my pitch for Thales Council,\n\nI am a Core Contributor at Thales at the role of Strategy and Growth with deep understanding of the project and its direction. (https://discord.com/channels/906484044915687464/907207156376424468/912279778705440768) \nI am really looking forward to Thales governance going to the next level with expansion of the Thales Council and officially starting the era of THALES token holders as the foundation of this protocol. I would really like to be \"on the frontline\" with our community to support this next phase of Thales by pitching for a seat as a council member.\nI am heavily involved in maintaining Thales governance structure ever since it was formalized. Authored the first iteration of Thales whitepaper (https://drive.google.com/file/d/10R3BDLozciZabRldJltKJc9ll_jU9ERn/view) and co-authored most of the TIPs so far with the rest of the CC crew and the first council members.\nIt is without saying that I have a deep passion for growing Thales not only as a CC, but also as a community member. I really believe that versatility and massive potential of Thales is to become rapidly more and more evident as the project evolves and the community-elected council is here to make it a reality.\n\npadzank.eth",
    "slade45": "I caved to no pressure. No one asked or wanted me to do this.\n\nQualifications:\n\nI own the thalesdisciple.eth ENS\nI'm not currently overburdened with other DAO responsibilities\n\nThe end.\n\nIn all seriousness though - I have been here from the very beginning of the discord.  The CCs are a solid group that have constantly delivered in some pretty trying circumstances and I've loved this project from Day 1. They have built a great product and I'd love to help extend its reach and growth and offer any insights I may have from a community/end user perspective.  I've been staking from the token release, a disciple in the discord, and died in Thales Royal.\n\nMy RL experience is in automation and programming and I've spent a lot of time building UIs for the least common denominator.  I've also helped or started several successful companies still in operation today and am still involved with all of them in some capacity.  I love defi and the technology its built on (I'm in it for the tech :pepe_laugh: )  I got started with blockchain/crypto way back when bitcoin first came out.  Mined it, lost it, and got busy following other ventures and have hopped back in the space with a vengeance earlier this year.  I love testing out new protocols and functionality and trying to break things.\n\nIf you have questions about me or what I do I'm a pretty open book.  HMU!",
    "Orilla | Thales": "Afternoon Titans \n\nI would hereby like to nominate myself for a position on the second Thales Council\n\nIt has been a pleasure to work as a Growth and Strategy Core Contributor since November. Supporting the launch of the Royale, exploring integrations with other protocols, working with auditors and treasury management. \n\nFor my DeFi background, I became a heavy user with the launch of Uniswap V2 in 2020 but have exposure back to the SAI launch and Maker Oasis DEX. Outside of DeFi, I have been involved since early 2013 and including late stage bitcoin GPU mining. \n\nI ventured deeper into the space following the launch of Uniswap V2, coming across the vibrant Synthetix community in November 2020. From there I moved from Synthetix community member, to xToken mod and now Thales CC. I have pushed for active discussion in each community and maintain key stats bots in most. \n\nMy background outside of crypto is in project management and process analysis, working to optimize manufacturing throughput by means of capital investment and smaller continuous improvement projects. This has led to development of a wide skill set across most engineering and management disciplines. \n\nI am extremely bullish on Thales in developing underexplored DeFi products, contrasting the constant uniswap, ohm and auto farmer forks. With the increased adoption of layer two and novel development with Thales Royale there is enormous potential for growth.\n\nIt would be a pleasure to serve as a member of the Thales Council, striving to represent the community with active engagement and discussion on growth and the future of the protocol. \n\norilla.eth",
    "Yannis | Synthetix": "Hi mighty Thales community, I decided at the last moment to nominate myself, after being intimidated by BigPenny's monstrous pitch. Better late than never they say...\n\nI am an existing member of the Thales council as well as a Synthetix core contributor (L2 integration and currently on the V3 team - Sooonthetix TM). I still remember when Synthetix launched binary options and it was the talk of the town so when I learned that an independent project would be spawned out of it I got very excited and I wanted to be part of it somehow. I learned a lot during the 1st epoch which was mainly about bootstrapping and launching the protocol and I am much more thrilled about the upcoming launch on Optimism which will unlock the full potential of Thales 🚀 🚀 🚀 . \n\nI am grateful I collaborated with the Thales CCs and got to know some of the most hard-working yet down to earth people in the space. We managed to reach consensus on occasionally tough topics and the CCs delivered always faster than expected. One of the things I think that the council should improve is being more transparent and sharing more with the community even though the CCs are amazing in doing that. I understood it late and I plan to improve personally on this. I think increasing the number of council members to 7 ( Sages) was a great decision not only for symbolic reasons. It will bring versatility, robustness and resilience which is so needed on a community-driven project like this 💪 . \n\nI have a very technical background and I have been designing and building processor architectures as well as embedded systems (what the kool kids nowadays call IOT). I went down the crypto rabbit hole back in 2015 but started working on crypto full time early 2017, as a smart contract developer. As most of the Thales CC can confirm, I am the annoying guy who is always asking about implementation details, smart contract risks etc. and I am planning to continue doing this as I think it is the sector I can contribute the most. I am also planning to bring the experience and the lessons learned from the Synthetix camp. \n\nI think I am addicted to DeFi and I am always trying to keep up to date with the latest pon...eehhm I meant innovations. I have managed to make a lot of friends in the space that work either in big protocols or have founded their own and I have a lot of insights and opinions about how a Defi protocol should run and operate. Hint: The Thales team is one of the best out there. Apart from that, irl...wtf, there is no life outside of crypto 🥳 .\n\nJust to wrap up my pitch, there are two key elements I want to bring up. I have a lot of skin in the game and I just want to see Thales, as well as the rest of the Synthetix ecosystem, succeed and silence all those FUDers once and for all. Everything I wrote so far could have potentially been skipped as I think my strongest card is that I cannot imagine a Thales council without a Greek sage. Ok just kidding...or maybe not 🤪 . Thanks for reading through 🙂",
    "Jean-Luc | Koji": "Gm Titans, I also am putting in a nomination. Similar to Yannis I am a little late but wanted to get a pitch in before the deadline. \n\nI’ve been working and collaborating with @Yannis | Synthetix , @dmonkey | Thales  and the other CC’s that make up the Thales council for the past 5 months. It has been a privilege to be involved in the process of developing Thales and observing the team overcome some challenges and experience some milestones. I am so bloody excited for L2 and some of the upcoming changes that I believe will make Thales really fulfil its potential.\n\nPersonally I have a background in statistics and enjoy aspects of market making etc. I have worked for both a bookmaker and an options trader in the past which has given me great insight into exotic market making and the dynamics of options. I have been involved in blockchain tech for about 4.5 years now and am fully consumed now. \nDuring my term as council member I have helped with some market data analysis, I have brought in some connections with Koji’s portfolio companies and we are currently trying to sort out an a-tier audit with a team I work closely with. I have a strong interest in aspects of governance and DAOs and hope to provide more input of that nature in the future. One aspect that I feel the council members have not been great at thus far is community engagement in the discord. This is partly due to differing time zones and other commitments but it is something I plan to improve on if nominated for the next epoch. I am also glad that we now have 7 members. This will allow us to have some members involved that are already very active in the discord and that provide value to the community.\n\nI work for Koji, a crypto native investment firm. We have spawned out of Mycelium, which has a number of pioneering DeFi projects and infrastructure. We run a verified Chainlink node which has plans to provide some custom APIs for exotic markets that Optimism projects may find useful in the future 👀 . We also are the service providers to TracerDAO, a derivatives platform on Arbitrum. Tracer is keen to collaborate with Thales in the future. At Koji we believe strongly in the Thales team and want to help the project to achieve success on L2. \nExciting things are coming for the future 🙂 lfg",
    "BiGs (WE DON'T DM 1ST!)": "Hello Friends. I’ll be nominating myself again this round. Sorry for my lateness, been away from home for a while. My name is Ben and I’m from NSW, Australia, 35 yo. I’ve been self-employed my whole adult life and run a couple of businesses which naturally led me to the defi world. I was involved with Kain’s Sydney based business Blueshyft with one of my businesses in which led me to invest into Havven and be apart of the community early on. 2017 was when I invested my time and money into the crypto space however I was accepting Bitcoin payments via one of my businesses since 2014 and was mining ETH in 2016. I was trading forex CFDs around 2006 which led into options and binaries (now retail banned in Australia) I have had a tastyworks option account for a couple years now trading spreads on mostly /si but also occasionally on bluechip stocks. I think every Australian has experience with sports betting app bookies which is the most common binary market used in the retail space. \n\nI am currently a Synthetix Guardian and a Thales Disciple. I’m finalising a staking guide for SNX via the gDAO and have been helping with updating the Synthetix FAQ bot too. I am still heavily invested into SNX since HAV and have only accumulated since (now on L2). Now also heavily in $Thales too. With a large chunk of my personal net worth invested in Thales and parent DAO, you know where my interests lie. I am passionate about decentralised finance and DAO governance and would love an opportunity to be on a prominent council board. I’ve been fully defi/on-chain since early this year and only using a single CEX as a fiat ramp. \n\nMy pitch: Being self-employed and an employer I have some decision-making experience under my belt. Coming from a different backdrop to the typical dev narrative allows me to bring diffusion to the decision-making table. I understand the core product Thales is offering including the derivative pathways of binary markets (gamification, gambling, hedging etc). Since my last pitch I am now a qualified VET teacher (adult educator) in Australia. The principles around this industry will be useful in gearing retail onboarding and understanding going forward with Thales. (Kolb’s experimental cycle, for example). I have no problem doing voice calls to properly discuss proposals etc and would encourage voice dialogue on any important DAO topic. In a nutshell, I’m a practical thinking down to earth guy who has a passion for defi and the principles it’s trying to implement.\n\nThanks for reading my pitch.\nbigs.eth"
}
