{
    "mzur | Player №: #1": "I‘d like to nominate myself for this position.\nAs an active user & community member of Thales since day one (and SNX for many many years) I believe I brought already some value to the community, features and the overall project of Thales - and love to extend that with beeing part of the OC.\n\nShort about me:\n[ ] Project management & strategy (10Y+) is my wife\n[ ] Marketing & advertising & finance (10Y+)is my date\n[ ] Defi & Crypto (5Y+) is my love\n\nI‘m a reliable, honest, funny and trustworthy person and happy to answer any questions from you guys.\nThank you!\n\nENS: zueri.eth",
    "Svenska": "Hi!\n\nI would like nominate myself for the Oracle Council.\nI have been following the SNX ecosystem for many years (HAVVEN holder) and have been very interested in THALES since its creation.\nThe project and the team behind it are top quality and very promising, that's why I’d like to contribute in its development.\nI used every feature and tried to bring constructive feedback to improve the experience.\n\nSome information about me:\n- Software developer (10+ years) and CTO (3+ years)\n- Egg finder on Tale of Thales\n- Soccer fan and tennis player\n\nI am diplomatic, serious and trustworthy. I think this can be important for this Oracle Council position, to ensure the success of exotic positional markets.\n Don't hesitate if you have any question and want more information about my profile. Thank you for your consideration!\n\nENS: svenskafr.eth",
    "Jref": "I would like to nominate myself for the Oracle Council \n\nI'm an active member of the Thales community and contributor of both ideas and Royale banter\nWhat stands out to me about Thales is the team's responsiveness and pace of execution, as well as the massive opportunity in bringing parimutuel markets to a broader audience  \nI think the world really is Thales' oyster, and I would love to put in work to help reach its full potential \nMy background is in strategy consulting and startups, currently working as country manager for a tech scaleup \nI'm a big believer in pragmatism, honesty, and the community being one of the most important assets an organization can have \nHappy to answer any questions!\n\nWallet: 0x1Ac8C3c376bdD5A3e8386A24710bcE77f85eCea6\nMay the odds be ever in your favor and may the bears get rekt we all get the profits we deserve",
    "redmarglar": "hey folks, i am nominating for the oracle council.\n\ni haven't been as active on the thales discord lately as i used to be but i have been following all of the discussions on the oracle council and exotic positional markets and i think it's a really big opportunity for thales to capture new users.\n\nit's important that the oracle council is made up of people who can think critically, are unbiased and can evaluate/poke holes in arguments. i have these skills from my experience in other governance bodies and from making decisions on policy questions in a semi-judicial role (city councillor).\n\ni think a bonus for oracle council members is if they have specific specialist knowledge in an area that we are likely to have markets in. i have that in the form of deep knowledge about electoral methods and parliamentary systems of government. should the oracle council have to adjudicate on issues to do with political markets, i will be very well placed to provide my expertise.\n\nin terms of thales and the synthetix ecosystem, my involvement in thales as a disciple, synthetix as a spartan council member and kwenta as an interim elite council member has shown (i hope!) that i am an an honest, trustworthy good actor.\n\nhappy to chat as always if anyone has any questions.\n\nENS: redmarglar.eth",
    "trades3ok": "Hello Fellow Greeks,\n\nI am officially announcing my nomination to the Thales Oracle Council.\n\nMy mission is simple: To ensure that Thales becomes the premier destination for on-chain parimutuel markets.\n\nHow will this mission be accomplished?\n\nBy being an honest, active, member of the oracle council. Participants in exotic markets reliant upon the Oracles need to trust that the true result of the match will be accurately relayed on-chain. \n\nDisputes will occur, and when they occur, my mission will be to ensure that true outcome is relayed on-chain. \n\nOverall, building and upholding trust in the reliability of outcomes on Thales Parimutuel Markets is the ultimate goal.\n\nI am staking SNX, I am staking Thales, I have participated in every Thales Royale. I am slowly building out a twitter profile that will bring more users into the SNX Ecosystem - with a focus on Thales. \n\nThank you to all who took the time to read my nomination proposal. This is the first of many - I plan to be here for a long time, getting more and more involved within the ecosystem as time goes on.\n\nLong Live Thales",
    "MiLLiΞ __/": "Hey everybody, \n\nI'd like to officially announce my nomination for the Thales Oracle Council and I can't even begin to explain how excited I am for the much anticipated launch of Exotic Positional Markets!!\n\nA lot of you may know me from the Synthetix community as an Ambassador to the DeFi ecosystem, but before I jump further into my pitch I want to just take a moment to give a huge shout out to Danijel and all the amazing shipooooors at Thales!!! My respect for Danijel's work cannot be overstated as I've seen first hand how much he's contributed to Synthetix over the years, in fact I learned so much from him since joining the community and I'm genuinely grateful for the positive influence he's had on me and my understanding of governance. His commitment to decentralization and DeFi values is un-compromised and it would be a pleasure to serve on a Council for a protocol he's founded \n\nAs an Oracle Council member one of my main goals is to see Thales's Exotic Markets reach a level of autonomy and scale that rivals any other similar service in DeFi or otherwise. I genuinely think the future of Parimutuel/Positional markets is in the decentralized world, where all events can be openly verified and where users have full transparency into the underlying process of event resolution. I think the current design of TIP-28 in particular is very scalable and straight forward from a user perspective and I'm really excited to see how it plays out in the wild, tested-in-production. \n\nThere are many implementations of Exotic Markets out there, but Thales approach as per TIP-28 is imo among the most elegant, in that it puts full control in the community's hands to propose markets and dispute them. In particular, the method of market creation is brilliantly simple and user friendly with what seems to be a great incentive structure to encourage good behaviour.  At the heart of TIP-28 however, are the Disputes that hold the entire mechanism together. Thales's novel approach to Disputing resolutions is quite sophisticated though not too technical for the average person to grasp or participate in, making me confident that it can scale compared to the many other Optimistic Oracle solutions out there. The Oracle Council's role to monitor all disputes and resolve them appropriately is of crucial importance and not to be taken lightly, after all, the faith of Thales users rests in the balance. I hope my involvement so far with Thales has been productive and proves my seriousness and dedication for the role. I think as an Oracle Council member I have what it takes to oversee our Exotic Positional Markets mature and improve over time while the community tinkers with it. \n\nTo end things off I want to give praise to everyone who is a part of Thales as a contributor and community member, the dedication and engagement I see here is truly impressive and of the highest standard imo. Thales governance has proved quite capable so far by transitioning seamlessly from a much narrower product offering at launch last summer on L1 to the amazing new features we see now, all the while overcoming any adversity along the way. \n\nI see a bright future for Thales and would be humbled to be a part of it!!! \n\nCheers and good luck to all nominees \n\nLong Live Thales\n\n0xmillie.eth",
    "JVK": "This is my self-nomination to the oracle council.\n\njvk.eth | 0x8be60fe9F7C8d940D8DA9d5dDD0D8E0c15A4288B\n\nI'm currently on the Kwenta Interim Council and am running for Synthetix Spartan Council.\n\nBesides Synthetix eco-system community, I'm also involved in Tally Wallet, a forthcoming - decentralized - competitor to MetaMask.  I am currently on their Gnosis multi-sig, which is the repository for all swap fees at this time.\n\nMy background includes IT, but my career has been as a practicing attorney.  I would certainly strive to treat all users ethically and fairly.",
    "Cvija | Thales": "Hello friends, \n\nI would like to nominate myself for the Oracle council.\n\nI am a Core Contributor at Thales since November, focused mostly on the quality and the improvements to the protocol. I try to figure out how things work, for what reason, and will the end user like it. Aside from that, I am a pretty active member of the community myself, helping out the members with their questions, taking part in the discussions, noting down requests and providing (hopefully) quality memes. \n\nAs for my background, before I joined Thales, I worked as a Quality Engineer in Corporate IT for 4 years. Most of the projects that I have worked on had a goal of developing  complex financial software in a heavily regulated industry, abiding by all the required procedures and standards. My job was to make sure everything works as expected, playing the middleman between the development and the business side.\n\nOutside of work, I am a:\n\n- huge sports fan (especially football and basketball)\n- CT lurker \n- Thales Royale player and Champion :greekpepeclassy: \n- Staker of multiple SNX ecosystem assets\n- beer drinker\n- pretty friendly\n\nBeing a member of the Thales teams, I was able to see first hand how quickly and passionately our team delivers, and there is not a doubt in my mind that Thales has a bright future ahead, with the decentralized Exotic Markets possibly being a big part of it. \n\nI feel like Thales is still unknown to a huge portion of DeFi users, and that it is very important to have a strong and reliable Oracle Council that is equipped to handle all kinds of scenarios that might arise early. In my opinion, the combination of my QA experiences and my involvement in the Protocol might make me a good fit.\n\nENS: cvija.eth",
    "mastermojo83": "I would like to nominate myself to the Thales Oracle Council \n\nWallet: 0x0dEf0BaCf09a27E0836EF3096F9c3AE859aC13eA\n\nMy day job: Environmental Regulatory Data Analyst Specialist & father of two boys\n\nMy passion: I have been in crypto since 2017.  I been spreading the value, educating folks, and sending positive vibes towards the SNX ecosystem since 2020. I am staker in SNX, Thales, Lyra, and Aelin (large bag of vKwenta too!) . I have been a long time lurker in all the discords, and want to step up and make a difference. I love what is being built, and would be blessed to be a part of it!\n\nI am very passionate about Thales and what is to come over the years with their Exotic Markets in a decentralized way! I will be here for the protocol to resolve disputes when they arrive. \n\nEven if I am not selected as a council member I want to contribute and help grow this ecosystem",
    "raffiegang": "Gm frens, \n\nI'm throwing in my head, woops I mean \"hat\"...\n\nAfter some contemplating and some nudging, I decided to take the red pill and nominate myself for the OC. \n\nIn my regular job, I work for a medium-sized company that engineers and deploys its own home-made web applications into the cloud. My experience here is mainly in web app development in various roles; developer, tester, requirements engineer, product owner, architect, et cetera.\n\nIn my spare time, I accumulate as much THALES as possible in my own modest way; my hands are diamond and I will not sell a single coin before we reach $92 and ride into valhalla! \n\nI enjoy learning about the SNX ecosystem - that also prevents me from spending too much time with the missus, the kids and our evil cat!\n\nSince I joined the SNX ecosystem I am contributing where I can; at Kwenta as product elite/admiral/bounty hunter, at SNX as one of the 300, and hopefully also for a OC role. \n\nThanks for reading my pitch,\n Raffie \n\nWallet = 0xF9bD5bdE14733C88FF763a9818AF69c3700FA021",
    "Coa | Thales": "Hello friends,\nI am announcing nomination for the Oracle council\nMy journey with Thales started in June last year, and core contributor from September. Since than I've been focused on quality and improvements of Thales protocol. Testing the dApp on daily basis with main reason to make it as much as possible intuitive and user friendly. I am following most of the channels and trying to help out members with their questions.\nBefore I joined Thales, I worked as Quality Engineer for a five years on different kind of projects. On some of them I have been worked with some other core contributors as well and I believe that it was recommendation for this great journey.\nI really like everything that happening around the Thales, and community passion as well. I am impressed by the team commitment and how fast things are rolling out. Because of that I have filling that we are just waiting for the moment to reach a big success.\nDecentralized Exotic Markets definitely could be a chance to reach it out.\n\nSome information about me:\n- Passionate skier and hiker\n- Real fan of different sports football, basketball, tennis\n- Played football for more than 10 years\n- Home made wine maker\n- Home made rakija maker\n\nAs an council member one of my main goals would be handling different kind of scenarios which might arise. I think that my previous QA experience and involvement into Thales protocol could be the benefit.\n\nCheers and good luck to all nominees!\nCoa\n\nwallet: 0xe966C59c15566A994391F6226fee5bc0eF70F87A"
}
