{
    "BigPenny": "My dearest Thales community\n\nthose past 4 months felt like an entire year to some people, me included. What I learned in those 4 months is that there is not a single moment in time where nothing important happens at Thales. Not being part of the Thales Council in those critical moments was very much torture. Being “The voice for direct distribution” I was very worried that the community could be ignored in favor of a loud minority. But the temp check voting came in clutch and managed to highlight the community sentiment to an impressive degree.\n\nAfter all that it was obvious to me, that I will never be able to idly sit by when it comes to Thales. There is too much on the line for $THALES stakers: Too much potential, too much hard work and too much money. $THALES stakers are the ultimate source of legitimacy and power at Thales. They are the ones who own the protocol and thus they need proper representation in the Thales Council.\n\nWith the community having signaled their wishes for the new tokenomics, I set out to oversee the proper implementation and protect it against attempts to alter it’s core values by people who spend a lot of time writing a lot of nonsense without having any skin in the game. I also want to oversee and  help shape the further product development of all Thales products. Bull Season is right around the corner, we already can see the occasional early signals. When the time comes, we must be ready to fully capitalize on it and a Thales council, fully staffed with both motivated and aligned Council members is critical for success.\n\nThis is why I nominate myself for Thales Council. Your vote for me is a vote for the Thales community and a bright Thales future!\n\nbigpenny.eth",
    "MrBreakout": "Hello everybody,\n\nAfter missing on last quarter I’am nominating myself again to council position.\n\nAs most of you know I’am quite active here, posting weekly AMM PnL and checking the numbers closely each week. Hence i believe i have a lot to say about TIPs submitted and contribute.\n\nIt was painful to watch everything from sidelines last quarter so i would like to get more involved and steer the conversation for the good of Thales protocol.\n\nPlease vote for me and help me get my seat back 🍻\n\nens: mrbreakout.eth",
    "milkywave": "gm\n\nLast epoch: Speed markets, Base, Integrators, Tokenomics overhaul, Player Props and so on! The entire team and the community have once again impressed me!\n\nHyped for the next epoch and that's the reason I nominate myself!\nIn my opinion we should focus on the following things, among others:\n\n- Account abstraction, this is for me personally (at least so far - who knows what else the devs are cooking up) the most anticipated feature Thales will have in the next epoch.\n- Get rev share implemented and having a big marketing campaign around it\n- Clever use of the 500K ARB grant. this is a great chance to massively increase our share on Arbitrum\n- Attractive programs to win more integrators\n- Hopefully more product-focused discussions instead of tokenomics and LP (we anyway gmi)\n\nI can promise to continue being open to compromises in decision-making, actively participating, while also standing my ground on my viewpoints, just as I have done before.\n\nI would be happy if you give me the chance to be one of your council members again! Ride the Milkywave with me 🥛 🌊.\n\nENS: cocomilk.eth",
    "anonymoushiro": "Hi,\n\n- I started exploring betting market explore in late 2018 with Augur, I remember how bad UI UX was. Thales is the obvious winner, impressed with how far DeFi has come since then.\n\n- Voted for fee distribution, I believe that is the DeFi standard as token holder. Users are smater than before. I could help to figure out next standard to stay alive in the game. My opinion comes from experience, 80% of the time SNX on optimism and others are DeFi on Arbitrum and Stacks so that I can compare to see what makes sense.\n\n- Currently testing another DeFi products as a tester\n\n0x4F6FFF5CD87EAf8cf09467366fe783E7Ecb1317B",
    "fhd": "Thales holdooooors,\n\nI have basically been the only one fighting for tokenomics changes for the past 6 months and would say I am the reason for the new tokenomics. You can see that I’ve made multiple TIP’s about Thales tokenomics, proving my dedication to the protocol. If you want someone that is in-tune with the rest of DeFi, and actually thinks of ideas to make changes for the growth of the protocol, in both the short and long term, you should vote for me. Many council members do not even make TIPs, but just vote and collect their Thales rewards. You can be assured that this will not happen with me. I also work in web3 and have a decent sized audience on Twitter. Thanks!\n\n0x5cbdb794b3b36df58a7ce6c1a552f117f061103b",
    "alex81sg": "Dear Community,\n\nFor the first time, I’m bringing forward my nomination for the Council.\n\nI have been actively using Thales and Overtime for over a year and I actively participate in Discord discussions around platform mechanics, tokenomics and UI/UX in general.\n\nLittle background on me: I am from Italy, been living in the US since 2010. I am a Public Accountant but now work as a Product Manager leading over 15 Scrum Teams that work on AI/Blockchain products for auditors. Married, guitar/violin player, fitness enthusiast and Spartan racer. My experience with blockchain started in 2018 and I am now actively involved in DeFi on various ecosystems.\n\nAs a Council member, I pledge to be a balanced advocate for Thales holders, LPs, and platform users. While I may not be a “large” THALES holder, in $ amount, my investment is surely material to my portfolio and therefore I have a vested interest (or “skin in the game”) in seeing this product continue growing in the future.\n\nMy focus will be on supporting the following:\n\n- Increasing user base through improved features/functionalities\n- Augmenting the utility of the THALES token (I already supported revenue share TIP 182)\n- Reaching new users through marketing campaigns\n- Multi-chain support, even beyond Ethereum L2s\n- Periodic re-assessment of tokenomics and incentives, based on market circumstances\n- Thoughtful use of ARB grants\n- I believe that increasing the platform user base is the key to long-term success.\nI will always respect everyone’s opinion, voice mine, and foster an environment where productive discussions can eventually translate into tangible value creation for THALES and its stakeholders.\n\nThank you!\n\nENS: redcondor81.eth",
    "Svenska": "Hey friends,\n\nHere we are, another epoch is drawing to a close, marked once again by many significant changes\n\nDuring this epoch, we had, among other things, Player Props & new Integrators on Overtime, improvements on Speed Markets (shorter timeframes & skew impact), carefully decreased LP incentives while ensuring we had enough liquidity for Thales token and finally our famous TIP-182 introducing revenue share for stakers, after a successful temp-check vote among our stakers\n\nWith just a few weeks to go before the implementation of revenue share, and given all the things the team is cooking up around account abstraction and significant improvements regarding contracts architecture, I have a feeling that the next epoch will be a promising and exciting one for Thales\n\nI decided to run again because I think I still have valuable contributions to offer and I want to continue to put my involvement to good use here.\n\nThis period has been marked by a few governance shortcomings, and I intend to propose measures to prevent this from happening again in the future, to ensure that our governance is constantly stronger and efficient\n\nThank you for your time\n\nENS: 0xsvenska.eth\n@CT: 0xsvenska",
    "dsigma_domega": "Hi Everyone,\n\nI have been a Thales staker since early this year. I had played with Thales earlier, but I was enticed to stake when I read about the tokenomics in connection with AMM LPing. Unique, and it’s only one piece on top of the broader gamified staking.\n\nBesides tokenomics, I am convinced that Thales has some of the best developers in Web3. The quality and speed of their work is top tier. Additionally, the community here is strong, everyone genuinely cares and wants whats best for Thales even if we don’t always agree. The above in combination is a recipe only for success and growth and I am happy to be a part of it.\n\nAbout me, I work for a crypto company as a quantitative researcher with a PhD in physics. Been in the crypto game for about 3 years. How I want to contribute, and why I am throwing my hat in the ring, is because I see some of the TIPs would strongly benefit from some quantitative analysis. Putting together some equations that may help determine the results of a particular TIP. May be a back of the envelope calculation or require running simulations.\n\nI enjoy open minded and well thought out discussions with little emotion (aka no drama). I hope you will consider me for a vote. Thanks!\n\n0x0b420da075B672DBb79BeB8FC9605a6998A9923b",
    "DegenSpareren": "definans.eth",
    "Jayref": "Dear fellow governance enjoyoors\n\nI’m throwing my hat in the ring for council once again. I’m even more excited about the upcoming epoch than I’ve been in past elections. The team has continued to build upon Thales’ product portfolio, and we now have an offering that’s incredibly well-suited to capture the interest of what appears to be a revival of retail interest in Web3. Let’s make sure Thales’ products are on the radar!\n\nI remain deeply overinvested (Thales by far being my #1 holding outside of ETH, which I LP Thales with) and I remain committed to getting Thales on the broader crypto map and grow volumes so that we may never sell our bags but cash in that sweet revshare every week\nI will continue to share my views openly, question and push back where I think it’s needed for Thales to reach its full potential.\nI believe the biggest focus areas for Thales remain 1) Generating more awareness via great campaigns and partnerships, 2) Continue to improve product UI/UX, and will do my best to drive this forward.\nWith CCIP+Revshare, Account Abstraction, and new grants around the corner, next epoch marks a critical chance for us to grow Thales’ footprint, so I encourage my fellow Thales holders to vote for candidates with a lot of skin in game and a track record of commitment to the protocol.\n\nWallet: 0x9eFa2B1E4C5D6443D302f68EF9e32E8666673bE5",
    "cyberduck | Spongly": "gm\n\nDucky here from https://spongly.eth.limo/ with some love for the community and CCs. What a protocol we have here with all the KPIs trending the right way!\n\nRunning for another epoch, both to help steer Thales/Overtime on continued growth path and to reflect that growth in earned value for all parties involved - stakers, LPs and integrators alike.\n\nYours flapping cyberduck.\n\nEns: wisequacker.eth\nX: https://x.com/cyberducketh",
    "electric": "electricbabe.eth bets on winning… 😉",
    "Vladan | Thales": "Hello Thales friends,\n\nI decided to run for Thales Council this epoch.\n\nAs for my background in Thales: I have been on Thales since day one and I am one of the first three Core Contributors. Focuses mainly on the technical part of Thales and development, was involved in the implementation of all Thales products: Thales markets, Thales Royale, Exotic markets, Overtime... Although working mostly on the dApp part, I can say that I have a very good overview of every part of the system and how it works.\n\nThe reason why I decided to run for the council is that in the next epoch the focus should be on better UX and acquiring more users.\nThe stuff that we have in the pipeline already, like account abstraction and contract improvements (with significant gas cost reduction for both, users and Thales DAO), are the main points to achieve the goals above.\nAll these changes are primarily technical challenges and second to explain and present to the community. I think in this area I can bring value to the Council and community.\n\nThat said, I see council involvement in this as required for Thales to advance to the next level.\nIn the previous period, I saw some room for improvement in council commitment and I hope we can enhance that together.\n\nWallet: 0xCc2EA17a8d17C1da05d5798a950dd9376ccF4e00",
    "padzank | Thales": "Hi Titans\n\nI will run again for the Thales Council in this new epoch as a CC representative.\n\nWill focus on maintaining a transparent and robust bridge between CC developments and the Thales Governance Structure and to keep growing at this pace with everything in symbiosis. For this new epoch I hope for us to have a professional and formal discussions with more emphasis on focused and concrete discussions and more thorough TIP edits and reviews.\n\nWith large shifts in Thales Protocol developments that solidify it as a more and more serious project, council member quality needs to also follow it's pace. The most optimal council needs thorough knowledge of the protocol and its current products, if it wants to professionally steer it in the right direction. Thales Protocol (thales.io) being the foundational infrastructure behind all interfaces that use it's contracts is the main paradigm shift of the next epoch that needs to be adapted to.  Optimizing the direction primarily towards increase in user base, increase in third party integrators and optimizing the architecture direction for both those ends is the name of the game for the next epoch.\n\nWith the masses slowly but surely finding it's way back to the blockchain space, 2024 is ours for the taking.\n\npadzank.eth\n\n0x11219d61e95fC5930762b16868dDB2C9c6fc83fA"
}
