{
    "Milkywave": "First of all, thank you for trusting me to be a part of the council in the last epoch 🙏 .The whole council had very intense discussions, did not always agree, but imo in the end always found a compromise to move Thales forward as a DAO. So thank you also to the council of the last epoch.\n\nMy personal highlight of the last epoch was, besides the launch of Overtime on Arbitrum as well as ToT v2, of course LP into Overtime AMM. It’s great to see how the fomo kicked in!\n\nFor the next epoch I wish a council that discusses just as joyfully and respectfully as the last one and continues to bring up new ideas with all available means to further develop both AMM and Overtime. I personally can contribute my part and will continue to take into account as many opinions and approaches from the community as possible when making decisions and bringing up tons of new ideas (and getting smashed on 80% of it - but hey that's the deal).\n\nThe biggest challenge in my opinion will be the scaling of Overtime. With increasing volume, other market participants will become aware of us and will try to disrupt us. On ARB we have the chance in the next epoch to position ourselves clearly on top, on the one hand by expanding LP to gain liquidity and on the other hand with a lot of marketing power and more features/sports.  But I don't want to put OP in the shade, we have already had good success there and it is important to continue at the same pace.\n\nI would be happy if you give me the chance to be one of your council members again! Ride the Milkywave with me 🥛 🌊 .\n\nLast but not least: my bet is still going on: OT on OP > AMM on OP before mid year!\n\nENS: cocomilk.eth",
    "BigPenny": "Greetings to the best community in all of DeFi!\n\nIt’s hard to believe that it has been only 4 months since the last election, looking at how much Thales and Overtime has grown. We have welcomed many new and active community members, introduced AMM LP (be the house!) on OP and Arbi, Vaults are going strong on OP and have been recently introduced on Arbi and we have introduced staking and voting on Arbitrum. In general we are pretty much at feature parity between OP and Arbi. All in such a short time. We also broke mind boggling volume Records. My personal little highlight was the launch of Tale of Thales 2.0. In general we had a pretty damn good time during what most people would to this day still call a bear market. While the big guys were letting thousands of workers go, Thales continued to grow and grow and grow, thanks to our fantastic Core Contributors and our one of a kind community!\n\nLooking at Thales Governance I consider the past 4 months to be the strongest epoch in Thales history so far. We currently have a very diversely opinionated and professionally balanced Council that is capable of intense, in depth discussion without ever losing it’s cool. No matter how tough the issue and how deep the trenches, no Council member ever lost sight of the big picture and thus we always managed to come to a well crafted compromise that was to the benefit of the entire protocol.\n\nInsofar I want to not just pitch for myself but for the entire current Thales Council, because this was in every way shape and form a team effort gone right! Every single one of them deserves to be re-elected! This should in no way discourage other community members to pitch for council. We literally have the luxury of having more good candidates than seats. So @raffiegang  @DeFiCandy  @Jayref and @SilvioDante please consider this your call of duty.\n\nI want focus on keeping tokenomics sound (including adjustments to AMM LP), resilience against compliance pressure and growth both in terms of multi-chain and untapped communities. In lack of a Grants Council I also want to work out ideas with my fellow council mates, how we can encourage more “third party” projects that build on top of Thales/Overtime, like Spongely. Especially looking for someone who is willing to create a mobile app that bridges the gap between web2 and us on web3.\n\nIf you are happy with my work as a Council Member and appreciate me being focused 100% on Thales and nothing else, then I would be honored to receive your votes in the upcoming election!\n\nENS: ancientgreekfrog.eth",
    "Cyberduck": "Quack frens!\n\nCanardly containt my excitement to be part of this DAO.\nYou know me, at least some of you do.\nBased\nEloquent, but consise.\nRational over emotional.\nDuckonomics are pretty good. Gating AMM LPing to Thales staked was an awesome move, but we need partial withdrawals.\nUser experience is what I care about.\nCucking mercenary LP incentives gradually in favor of protocol owned liquidiy.\nKwenta of Overtime as an analogy when thinking of Spongly #tip-123-overtime-plus-grant-request\n\nENS: wisequacker.eth",
    "electric.L2": "electricbabe.eth bets on winnning",
    "MrBreakout": "Hello fellow Thales community\nI’am nominating myself again for the council.\n\nThales is growing consistently and I would like to keep an eye on critical decisions being made otw if you allow me\n\nJust to give you a summary of my thoughts\n\n- I’am a supporter for protocol owned liquidity and decrease our dependency/cost of liquidity providers.\n\n- I would like to keep the balance of rewarding thales token stakers and serious traders. I’am a firm believer of gamified staking hence for me it makes sense to reward users making most of thales protocol.\n\n- I like what Spongely is doing and I believe its critical for us to increase our decentralization process. Hence I’am eager to see growing third party thales integrators.\n\n- I got lots of heat for proposing to end buyback and burn program but nevertheless i think thales did a smooth transition to new profit sharing mechanism for fellow stakers (OT and Vault liquidity provider option). Plus we are growing safebox balance each day to use it for rainy days.\n\n- I will keep closely monitoring our volume and performance over all our products and draw attention to important milestones achieved.\n\nLastly, if I can get one, I will wear my thales tshirt/hoodie in ETHcc Paris, represent our project proudly and spread the word\n\nThank you for your support 🙏\n\nENS: mrbreakout.eth",
    "holmberg.": "Hello everyone!\n\nI'm quite new around here, and I've been mostly active in Overtimemarkets so many not might know me. But in the short time I've spent here, I've grown to love what this community is building. That's why I wanted to nominate myself for council. And if I don't get selected, I still wanted to take a moment to say hi to everyone.\n\nI don't have a long CV related to Thales, but I'm really interested in the development of the Overtimemarkets. Especially with the campaigns I've proposed, I think I can help improve the service and make it more attractive.\n\nI've been a professional bettor for 7 years, and I have lots of experience with everything related to betting and gambling. Tip services are something where I have really developed and my knowledge is extensive. I know what casual players want from tips and how good services work. So, I think my experience can be useful atleast in the development of Spongly.\n\nIn the future, I think the biggest challenge for the Overtimemarkets is to be attractive enough for casual players, but not too good that professionals can empty the bank. In my opinion the only solution to this is offer various competitions and campaigns, which, however, increase volume and bring income.\n\nThe current parlay competition is already doing well, but I think we can make it better by distributing the prize based on the bet amount multiplied by the total odds. This would really help increase volume. I also have my own idea for a campaign - it's similar to what was on Thalesmarket's side, but it's for betting. It's called a \"double race\" where you double your bet every day for a week. And on the weekends, we could have a \"triple race\" with the same concept. After winning you continue betting the next day what you won yesterday. \n\nHere were my thoughts and a bit of my background. If you feel that my ideas align with the future development of Thales, and you believe that I could be a valuable addition to the council, I would appreciate your vote. I promise that I will do my best to contribute to the community and the growth of the Overtimemarkets. 🤝\n\nENS: holmberg.eth\nLENSTER: @dbsdao",
    "dandan": "Hello everyone!\n\nI would like to nominate myself for the council, specifically for Overtime. I started learning about Optimism about a year ago and among all of the dapps on Optimism, Overtime is my favorite one.\n\nI have two pitches to share here.\n\nI love the parlay competition but I believe it can be better and more fun. I think we should take the volume of a ticket into account and come up with a rule to calculate scores for each parlay ticket. Not only should we take into account the position count and quote, but also the volume as well. We can classify the volume into several tiers and every tier has a specific multiplier to the final score.\n\nAmong all of the markets, I love NBA and esports most. I think we can appeal to more users by enriching our play modes. One immature thought is to launch a collection of CSGO player cards NFT with these attributes: player, team, weapon, map, rarity (gold/silver/bronze), etc. And before a CSGO game begins, specific NFT holders (maybe who has the attributes with player or team is in this game) can participate in a prize pool by choosing a winner team. When the game ends, holders who picked the right winner can share the prizes. Prizes can be Overtime vouchers or vouchers for CSGO skins in Steam. Trust me, all CSGO bettors would love to gain a CSGO skin.\n\nAs for myself, I’m a software engineer focused on backend development. I’m good at Kubernetes and Docker and C++ and Go but not so familiar with TS or Solidity. If any part-time engineering work is needed, I would love to help.\n\naddress: 0x59617225C006871c2a279089570063F0294Ae2c9",
    "jack-anorak | velodrome": "hey i'm throwing in for council as a general purpose prediction markets guy\n\nthink my commitment to supporting thales and extreme advocacy for distribution and user experience are well known by this point though happy to back up this claim.\n\nmy primary focus on the council would be on supporting growth initiatives, as i did with Overtime on Optimism two seasons ago. we've seen massive uptake in both crypto- and non-crypto-based betting, so the populations are there. the big question is how to get overtime at the top of that list, and, once people are exposed, ensuring we deliver the kind of experience that keeps them there.\n\ni'm current velodrome team member and grant council at optimism. been ghost in the machine for a few daos and projects in crypto, before that spent years at the top of prediction markets, deep in that world still. also have the whole professional stack to rely on so if ppl want powerpoints or financial models i can idk farm those out to summer analysts 🙂\n\nens, jackanorak.eth",
    "Coman": "Hey there, Thales community!\n\nI'm excited to throw my hat in the ring and nominate myself for the Thales Council. I've been a professional sports bettor since 2015 and have spent years advising bookmakers, working with traders, syndicates, investors, and tipsters. A few months ago, I joined the Thales community, and I've been absolutely loving especially OvertimeMarkets — the sportsbook.\n\nHaving seen the crypto-based gamified experience landscape evolve, I'm eager to contribute my expertise to help Thales continue to dominate as the market leader. Here are a few ideas I've cooked up:\n\n1. Sports Trivia and Quizzes: Introduce sports trivia and quizzes that users can participate in to win Thales tokens or other rewards. This would add an extra layer of entertainment to the platform and engage users who enjoy testing their sports knowledge.\n\n2. Betting Challenges: Create a series of time-limited challenges that require users to complete specific betting tasks, such as placing a bet on a particular sport or market. Successful completion of these challenges could be rewarded with Thales tokens or other platform perks, encouraging user engagement and platform exploration.\n\n3. Bet With Friends Feature: Adding a social component to OvertimeMarkets, we could allow users to create custom betting groups with friends, where they can share bets, track progress, and compete against each other. This feature would encourage users to invite more friends to the platform, boosting growth. I'm well aware that you're already building something like this but would love to include some \"closed group\" options there to spice things up.\n\n4. Virtual Sports Betting: Introduce virtual sports betting, allowing users to place bets on simulated sports events that run continuously throughout the day. This would offer an alternative form of entertainment for users and keep them engaged during real-world sports off-seasons or periods with fewer live events.\n\nI'm genuinely passionate about Thales and its potential to revolutionize crypto-based gamified experiences. If you feel my background and ideas would make me a valuable addition to the Thales Council, I'd be honored to have your vote. I promise to work tirelessly to ensure Thales stays ahead of the curve and thrives as a platform that brings people together through the excitement of betting.\n\nYou can also check part of my betting activities on nutduck.blogabet.com\n\nens: lowstakes.eth & coman.lens",
    "Svenska": "Hey friends,\n\nHere we are, almost 4 months have already passed since I was elected as a council member 🙏\nAs we know with crypto, time goes by very fast and we have worked together to make Thales evolve in the direction we think is right.\n\nI will not list everything that has been undertaken but rather focus on what, in addition to all the new features, has strengthened Thales and ensured its stability.\n\nFirst, the deployment on Arbitrum (of the $THALES token, Thales AMM, and Overtime). This allows us to be deployed on the 2 main L2s and to no longer be solely dependent on Optimism\n\nThen, the long-awaited Overtime Liquidity Providing, aka \"be the house\" product. This feature lays the foundations to allow Overtime to no longer depend only on Treasury to provide liquidity and to be able to scale to offer way more markets, with increased liquidity, on more networks.\n\nFinally, the opening of new sports such as esports or cricket allows for attracting a more and more differentiated public and ensures a lesser dependence on other seasonal sports (soccer, basketball, and so on).\n\nThe continuous effort made by all the CCs during these months of bear market let me foresee a very promising future and seeing the community growing day by day supports me in this idea.\n\nI decided to run again because I think I still have many things up my sleeve to help Thales move forward\n\nOn the governance side, I would like to explore ways to involve the community more actively in writing new TIPs. It remains to be seen if this will be done through a simplified process, through a remuneration for each TIP written and voted, or through a mix of several things.\n\nOn the features side, the arrival of Spongly with a first release planned for this summer is very exciting and could pave the way for other front-ends, which will reinforce the resilience of Overtime while offering additional features.\nOne of the priorities will be to make Overtime known to as many people as possible, by finding ways to reach a very large audience, to let them discover this wonderful product\n\nRegarding $thales liquidity, I think the right decisions have been made lately and that Protocol Owned Liquidity is the next step to reach on every network, to ensure sustainability and independence to third parties.\n\nGood collaboration between council members and CCs is paramount and I am prepared to continue to carry it out with enthusiasm and dedication\n\nThank you for your time\n\nENS: 0xsvenska.eth\n@CT: 0xsvenska",
    "padzank | Thales": "Hey Titans!\n\nPutting in my name once again for the upcoming Thales Council Elections!\n\nI am a Strategy Core Contributor of Thales and I would like to continue representing the Titans and together grow the Thales Protocol together with the community that constantly growing in numbers and talent diversity. We are seeing many new community TIPs popping up, new community members actively participating in governance and overall governance growth on all metrics. The future is bright.\n\nWe start this new epoch with a technically mature products that are ripe for expanding the userbase and reach. One new important aspect of the following governance epoch is the focus on constantly improving User Experience of the products, optimizing growth for user acquisition, work on onboarding on-chain-native sport enthusiasts and perhaps also think of ways to further gain interest from the off-chain demographic. With each new epoch comes new challenges, new features and new discussions. I would love to continue being a part of it all with the community and assist as much as I can in this journey.\n\npadzank.eth",
    "Onizuka Eikichi": "Hello everyone. I am Onizuka from Thailand. I started using Thales protocol since mid of last year. My main focus is binary option trading. I talked, shared my binary option strategy trading a lot in my personal twitter. Thanks to @kevin, who introduced me to be a part of Thales Olympians team. After joined and being an Olympian, I have run the Thales Thailand and keep sharing  my Thales investment performance in my personal twitter.\n\nAs an individual investor and work experiences in marketing and sales, the very significant milestone of Thales for me is the metaverse \"Tale of Thales\" (ToT), Thales market vaults and the Liquidity Providing to \"The House\" in the Overtime market.  These 3 products has fulfilled Thales ecosystem, step up the utility of Thales token and expand the opportunities to on board new users to use the protocol and improve the way to interact and launch the quests with the Thales community.\n\nIn my opinion, After launch the ToT and Overtime LP program, Thales ecosystem is now at the stage2, the maintaining stage. Bear market is a chance for investor to accumulate the crypto assets with low price. For the protocol, is time to improve the protocol in accordance with users' behaviours and needs. Thales has launched in L2 Arbitrum, then we should focus on increasing the trade volume by keep using marketing campaigns and in the same time maintain the trade volume in Optimism.\n\nBefore arrival of the next bull run, in this stage2, ToT  will come to play the main role and will be the most economy way to draw new users, educate them and encourage them to use and become repeated user by doing quest both daily and occasionally. The main focus is to encourage new users and Thales community to try & use the protocol. They can have in game gold coins in return which can be exchanged to trade vouchers or buy NFT such as fishing rod, clothes, tools, decoration in the in-game NFT marketplace.  Because of the ToT is fun and everyone can join and have fun together, it will become a soft power of the Thales Ecosystem, connecting and maintain relationship between  users and protocol through many marketing campaigns, organize meet-up or sports watching  events, etc.  I self-organized a meet up with my Thai community once, got very good and useful feedbacks for further improvement. During the meet up, I took them to see around the Miletus town, led them do harvest quest, took a group photograph. We had fun and a great time together. Hope there will be more mini games and activities to do, includes fighting quests asap.\n\nWe already have Olympians, but in this stage2 we may need an ambassador programs, which is more focus, more active and more intensive on building up community in each country. Let more people know the protocol, follow the official Twitter, join the discord server. Once we build up repeated user and Thales community. Thales protocol will be ready for the next stage when the bull run has come. To Find big partners, use all the resources to incentivize and maximize the use of protocols.\n\nAbove is the roadmap that I have been thinking of since the launch of \"fishing competition\" in Tale of Thales. If I have elected as a council member, my decision on voting TIP will be based on the benefits of protocol and Thales token holders. By the way, no matter what the result is I will keep supporting the protocol in the parts I can do as I have been doing.\n\nThank you very much\nOnizuka\nSawaddee Krub ^_^\n\naddress: 0x417878C9ce83f1C0A9a9d517C388e0F70235703E",
    "Pure": "Hello all,\n\nI doubt I will be considered but I saw the reminder tweet and thought I would throw my hat in the ring for the sake of it.\n\nFor many years, I have been a professional sports bettor: exploiting bookmaker's mistakes and learning more than anyone else about specific leagues to bet profitably on them\n\nIn the past year (and a bit) I have worked on Purebet, a sports betting protocol on Solana. We take the odds and liquidity from many on-chain bookmakers/exchanges (including Overtime), and show them in one place. When a user bets with us, we place the bet at the source on behalf of the user.\nBecause of this, I have worked with the Overtime infrastructure and smart contracts, as well as those of competitors. I dont mean to sound insane, but I probably have the best understanding of the on-chain sports betting space out of just about anyone.\n\nFrom my experience as a professional bettor, I have a great understanding of the off-chain sports betting space, from how prices are formed and the flow that dominates the market, to customer behaviours and preferences.\n\nOvertime is in the position of the most established on-chain sportsbook/AMM type venue I would love to contribute to help keep it on the amazing growth it has seen since before the World Cup, while fending off the competition which I know will be very fierce in the coming months.\n\nI dont tweet too much but it is mainly about crypto x sports betting if you want to see opinions I have, my username is Pure_lmao\n\n😇\n\n0x86f4e0fF025fb048BdDFC1649a671735ad7b2aFD",
    "Cvija | Thales": "Hi friends,\n\nI've decided to run for the Thales council once again!\n\nI will try not to repeat myself, as most of you know me. I am a current Thales council member and Thales core contributor. I make sure that our dApps work as expected while keeping a bit of a broader overview of all the work that is being done. I foster connections between our rapidly expanding community and the dev team, ensuring that everyone shares the same goal. However, my personal favorite is helping people with getting their problems fixed.\n\nA lot of people mentioned all the significant things that have been done - deployments to more networks, more vaults, new markets on a weekly basis, and maybe the most exciting of all, the external LPs. I can assure you this is just the beginning and many more interesting things are coming your way. Some of them you can see yourself, as the governance sections have been more active than ever, with TIPs starting as simple propositions, and ending up with 200 replies, a lot of them being from new members - imho bullish.\n\nFor the next epoch, I have a couple of topics I find very important and would like to push:\n- Simplifying the Thalesmarkets trading experience. Although very complex in the background with lots of computation, the Thales markets are supposed to be easy, either UP or DOWN. It seems that we can do a better job of conveying this to the users. This is something that got pretty apparent during some of these galxe (or similar) quests that we have been seeing lately.\n- Extending the Overtime offering. Since the summer of 2022, Overtime has come a long way - multiple redesigns, many new sports, different types of markets, vaults and LPs etc. With the help of this, Overtime is a platform being used daily by many users, on multiple chains, delivering a steady positive PnL to its' LPs. However, to truly offer an experience similar to the one of a web2 sportsbook, we still need to deepen our offering, and by that I mostly mean player props, scores by periods, futures, special premade parlays, all the typical stuff the users love.\n- Finding a way to collaborate with other protocols/pages in a mutually beneficial and organized way. I personally think the Olympians initiative has been an amazing idea and I love seeing it work, but tapping into other protocols pools of active web3 users is something that could be a game-changer for us.\n\nIf we are on the same page regarding the future of the protocol, it would be my honor to once again be a part of the council. Cheers!\n\nens: cvija.eth"
}
