{
    "cyberduck.eth (rubber^duck)": "Your favorite duck is flapping his wings again to agitate for your support. Past 6 months I've taken a liking to Thales and its products. I have subsidized Royale markets and the AMM with plenty of losses. With experience I am starting to understand what it takes to keep someone engaged with a loosing streak, and that's what we need, more degens like me. My favorite products, albeit not in $volume are the exotic markets, having set up multiple hockey markets and participated dozen others. I am super excited for overtime markets and I'm betting on that being a good driver of retail attention in the future, assuming we tackle the onboarding friction and deliver a UX that does not scare. I'd love to be able to help in any capacity, even beyond what's expected from a council member for another epoch to bring adoption and ultimately value accrual for token holders.\n\ncyberduck.eth",
    "BigPenny": "Dear Titans! A friend once told me that wishing someone to 'live through interesting times' is a polite way to curse them in some cultures. We surely do live in 'interesting times' right now and there is no telling how much more 'interesting' it will get in the coming months. Times like these are what separate the wheat from the chaff.\n\nI am very bullish looking at THALES and I have litterally 0 worries about THALES surving the current recession. While other projects blow up and people flee in droves, we are literally welcoming the opportunity to test our AMM and improve the logic to make it more robust for the future. The amount of high quality services that THALES has launched during the last 6 months alone is more than most DeFi projects manage to build in two years and there is still more to come. As long as DeFi as a whole survives (and for me there is no doubt that it will), THALES will be mighty fine and come out way stronger than most others.\n\nFor the upcoming epoch I want to focus on rewarding those that stick with us during the harsh times and make tokenomics more robust for the protocols long term health and success. Those won't be dramatic changes but iterative fixes to issues and applying some lessons learned from the past 6 months. In regards to protocol services I am excited to support both the dev team and Oracle Council as much as I can on the contract and metagovernance level. The current market situation does give us valuable time to find solutions for unsolved issues, like scaling of our non-AMM services. As far as marketing goes, I want to be more open to new ideas than I was in the past and enable experimentation and improvements to user acquisition and user retention. I know there are community members among us that have both the qualification and the conviction to drive protocol adoption significantly if we give them the ressources to build now, so we are ready when the next bull cycle starts.\n\nOn a more personal note: I lived through pretty much the worst time of my life during the past couple of months and that resulted in me intermitently acting towards people I love, respect and cherish in ways I deeply regret. I want to apologize to everyone I have treated unfairly during discussion, especially @Danijel | Thales  and @padzank | Thales  who I gave the hardest time of all. I want to thank the Thales Team and the Thales Community for bearing with me during that time and for treating me kindly, no questions asked, after @dmonkey | Thales managed to snap me out of it by literally owning me with facts and logic. (Free boomer meme!) I now know for a fact that my love for the Thales Community is mutual and I would be honored if the Thales Community would allow me to serve another 6 months on the Thales Council. Nothing fulfills me more than the opportunity to help make THALES the most successful project on Optimism!\n\nWallet: ancientgreekfrog.eth ",
    "Red | Thales": "Last epoch on the Thales council was my first taste of decentralized governance as a council member, and I believe I have brought great insight and feedback to the multiple TIPs we have seen over the last 6 months. On top of this, with the help of @beachmom | Thales 'How to write a TIP' article, I have written my first two TIPs in the previous months, and I am here to keep on-boarding members into the Agora. Focusing on community requested features such as account merging, phase0 distribution, exotic markets, etc., as always, my goal is to represent the dedicated members of our community.\n\nAdding to this and looking at the development pace by our team I believe it is important to have council members that are knowledgeable of our protocol. As a Thales core contributor, knowing the ins and outs of Thales and its community is a big plus, and I believe I am an ideal candidate to operate under the current healthy governance model we have. We have big things coming up in this next epoch and I believe your vote here is more important than ever.\n\nwallet: 0x752cdfdffaeebe73bb1388f69f94553ade64c988e",
    "Jayref": "Greetings fellow positionoors,\n\nAs a Thales Royale permabull, I’m no stranger to pain, disappointment, and bera bashings. But even then, the last few weeks in the markets have been truly dark and depressing for many of us. Thankfully, there are a few lights in the dark, and a massive one is the incredible pace of product development and community spirit I’ve seen in Thales. We’re at the very early stages, and I’m incredibly excited and bullish about how far we can take this, and so I’m throwing my hat in the ring for Thales Council \n .As a community member, I play an active part, always staying on top of this Discord and promoting the great work of the team, whether in Discords, on Twitter, or elsewhere, and am highly persistent in my donations to the AMM. \n\nI’m excited about the prospect of joining the Thales Council, as I find the product originality, innovation, and general accessibility is like nothing I’ve seen elsewhere. \nI believe we have an incredible opportunity to bring Thales to not just the hardcore options-trading defi community, but to a much, much wider audience via products like Exotic Markets and Overtime. \n\nWe may be small now, but if there ever was a crypto protocol with the potential to become a household name, it’s Thales! \n\nAs a council member, I believe in being transparent and communicating directly and honestly, even if the opinion is unpopular. \nFor the coming epoch, I believe we should actively strive to not just grow our mindshare of the larger Synthetix ecosystem, but think even broader still. We’re in the fortunate position of being a unique protocol with original, innovative, and decentralized products, so I feel confident that we can grow user adoption a lot with a focused and creative communications plan. We should also continue to focus on making the UI&UX more intuitive, as it will be key to product adoption by a wider user group.\n\nWhether Thales Council or not, I am highly appreciative of this community and look forward to seeing what the next epoch holds in store for us. \nLet’s get it to $91 \n\nWallet: 0xe73304c94da7f7b32d86199bc967299da2a0fc19",
    "ramblers99": "Fellow DeFi Summer 2.0 survivoors (so far):\nI am once again asking for your support for another epoch on Thales Council. Regardless of the current valuation of the token, I am substantially more bullish today than I ever have been in the past. I take pride in representing the avg non-technical user and savvy investor on the council.\n\nWhat you can expect from me:\nI try to keep my written opinions on TIPs quite brief and to the point, and I always state my reasoning before I vote. However, I am certainly not afraid to push back or seek clarification on any issue.\n I will be timely with my votes. I travel often, but keep council in the loop on 'extended' timeframes away (rarely over 12 hours/flights). My opinions will also come later in the discussion unless I truly don't understand the TIP or need context early on.\n\nMy current stance on Thales (project), $Thales (token), and the future:\n1. The Thales project imo, is about to enter an entirely different stratosphere with sports positions (Overt1me). We have but a small window to make a big lead in this decentralized space. I am very much motivated to incentivize customer acquisition!\n2. Governance tokens need to do more than elect me! The current council and team have been very open and able to pivot on creative ways to bring value to the token. If the governance token model survives it will only be because of teams like ours that adapt and drive value. I will do everything I can to ensure that happens long term. Sometimes that means making uncomfortable decisions that impact the short term and/or partnerships that are deemed not sustainable for Thales.\n3. The future is bright in crypto! I am not a moonboy but I am certainly permabull. We need tokenomics that capture true value and we need customer acquisition and easy on-boarding... just like all of DeFi. We just happen to have the best team to pull it off.\n\nWe are building something special here and my DMs are always open to hear your input.\n\n- Seth\nwallet: Vote4S.eth",
    "MrBreakout": "Dear members of coolest protocol in DEFI,\n\nTime flies and it is election time again !! Hence, I'am nominating myself for Thales council.\n We are going through tough times with unseen level of negativity and sell off in crypto markets. \nHowever, I believe its best time to build, extend our reach of user base and community.\n\nFor people who don't know me, I'am Enterprise Software Techno - Functional consultant transitioning into crypto, active member of snx protocol and heavy defi user overall since early days of uniswap.\n\nDuring my last council position, I tried to read, digest, discuss and ask about every TIP submitted to us. \nI never missed any votes and did not hesitate to contradict with other fellow council members to keep my ground. I'am getting involved more and I already got voted and approved TIP thanks to @Cvija | Thales.\n\n As a summary, I would be more than happy to contribute thales in any capacity I can again.\n\nWallet: mrbreakout.eth\nCT: @IamMrBreakout",
    "padzank | Thales": "Hey Thales Titans!\n\nI am officially nominating myself for the Thales Council to continue participating in the growth of the Thales protocol from the front lines!\n\nWe are finally maturing as a product, all pieces are falling into place and we are on a brink of an explosive growth phase. Now more than ever we need a focused and efficient Thales Council who will help steer the products (YES THATS PLURAL FOR PRODUCTS) in the optimal direction.\n\nNew easy fiat and cross-chain onboarding, exponentially better UX with multi-collat support, novel types of markets exposure, worlds first on-chain Sports Markets AMM (thanks Chainlink), successful novel Exotic Markets solution, best Referral Program solution in the game and we are just getting started.\n\n As a Strategy Lead Core Contributor and, above all, a passionate community member I am fully motivated to continue working together with the community and the fellow Thales Council members to continue with the upwards trajectory.\n\npadzank.eth",
    "JVK": "This is my TC self nomination.  My public wallet is jvk.eth.\n\nI was active on the OG Thales discord but lately less active here as I was occupied with being a new SC (Spartan Council) member and being involved at another DAO as well.\n\nIn governance, I tend to be somewhat conservative and focus on what I view to be the long term health of protocols vs short term gains.\n\nI am generally liberal re things like pursuing partnerships and cross promotion outside of protocols.  I think they need to 'network' just like IRL somewhat.\n\nIn addition to SC, I'm still on council for Kwenta Interim Council too.  However, most of that epoch work is done as we are mainly waiting for DAO launch and new elections there soonthetix.\n\nWhether we are in crypto winter or just a dip it doesn't matter to me that much.  I'm in this for the tech. :)   My day job is a practicing attorney with a background in IT and accounting/finance and my day job even includes crypto/forensics sometimes, which is how I first got exposed to it.  I also  started learning about it through various personal connections who work full time for crypto projects too.\n\nI have always liked Thales and think there is an amazing protocol being built here that needs to find the right audience.  I'd be happy to help make that happen however I can."
}
